Repository: Shangjin-Xiao/ThoughtEcho
Catalog: lib/l10n/app_*.arb
Languages: fr, ko, zh

source: Current Data Directory
fr: Répertoire de données actuel
ko: 현재 데이터 디렉터리
zh: 当前数据目录

source: Custom
fr: Personnalisé
ko: 사용자 지정
zh: 自定义

# windowsDataMigration
source: Windows Data Directory Migration
fr: Migration du répertoire de données Windows
ko: Windows 데이터 디렉터리 마이그레이션
zh: Windows端数据目录迁移

# windowsDataMigrationDesc
source: Migrate app data to another location (e.g., D: drive) to free up system disk space
fr: Migrer les données de l'application vers un autre emplacement (par ex., lecteur D:) pour libérer de l'espace disque système
ko: 앱 데이터를 다른 위치(예: D 드라이브)로 이동하여 시스템 디스크 공간을 확보합니다
zh: 将应用数据迁移到其他位置（如D盘），释放系统盘空间

source: Change Data Directory
fr: Changer le répertoire de données
ko: 데이터 디렉터리 변경
zh: 更改数据目录

source: Migrating...
fr: Migration...
ko: 마이그레이션 중...
zh: 迁移中...

source: Confirm Data Migration
fr: Confirmer la migration des données
ko: 데이터 마이그레이션 확인
zh: 确认数据迁移

# migrationTargetPath
source: About to migrate all app data to:
fr: Sur le point de migrer toutes les données de l'application vers :
ko: 모든 앱 데이터를 다음 위치로 이동합니다:
zh: 即将迁移所有应用数据到：

# migrationWarning
source: ⚠️ Migration may take several minutes. Please do not close the app during this process. ⚠️ You will need to restart the app after migration is complete.
fr: ⚠️ La migration peut prendre plusieurs minutes. Veuillez ne pas fermer l'application pendant ce processus. ⚠️ Vous devrez redémarrer l'application une fois la migration terminée.
ko: ⚠️ 마이그레이션은 몇 분 정도 소요될 수 있습니다. 이 과정 중에 앱을 닫지 마세요. ⚠️ 마이그레이션이 완료된 후 앱을 다시 시작해야 합니다.
zh: ⚠️ 迁移过程可能需要几分钟，期间请勿关闭应用。 ⚠️ 迁移完成后需要重启应用才能生效。

source: Start Migration
fr: Démarrer la migration
ko: 마이그레이션 시작
zh: 开始迁移

source: Migrating Data
fr: Migration des données
ko: 데이터 마이그레이션 중
zh: 正在迁移数据

source: Migration Complete
fr: Migration terminée
ko: 마이그레이션 완료
zh: 迁移完成

# migrationCompleteMessage
source: Data has been successfully migrated to the new directory! Please restart the app for changes to take effect.
fr: Les données ont été migrées avec succès vers le nouveau répertoire ! Veuillez redémarrer l'application pour que les modifications prennent effet.
ko: 데이터가 새 디렉터리로 성공적으로 이동되었습니다! 변경 사항을 적용하려면 앱을 다시 시작해 주세요.
zh: 数据已成功迁移到新目录！ 请重启应用以使更改生效。

# migrationFailed
source: Data migration failed. Please check the logs for details.
fr: Échec de la migration des données. Veuillez vérifier les journaux pour plus de détails.
ko: 데이터 마이그레이션 실패. 자세한 내용은 로그를 확인하세요.
zh: 数据迁移失败，请查看日志了解详情

# migrationFailedWithError
source: Migration failed: {error}
fr: Échec de la migration : {error}
ko: 마이그레이션 실패: {error}
zh: 迁移失败: {error}

# selectNewDataDirectory
source: Select New Data Storage Directory
fr: Sélectionner le nouveau répertoire de stockage des données
ko: 새 데이터 저장 디렉터리 선택
zh: 选择新的数据存储目录

# directoryNotAvailable
source: Selected directory is not available or lacks write permission
fr: Le répertoire sélectionné n'est pas disponible ou manque de permission d'écriture
ko: 선택한 디렉터리를 사용할 수 없거나 쓰기 권한이 없습니다
zh: 所选目录不可用或没有写权限

# selectDirectoryFailed
source: Failed to select directory: {error}
fr: Échec de la sélection du répertoire : {error}
ko: 디렉터리 선택 실패: {error}
zh: 选择目录失败: {error}

# logsViewer
source: Log Viewer
fr: Visionneuse de journaux
ko: 로그 뷰어

source: Log Filter
fr: Filtre de journal
ko: 로그 필터

source: Clear Logs
fr: Effacer les journaux
ko: 로그 지우기

source: Search logs...
fr: Rechercher dans les journaux...
ko: 로그 검색...

# noLogs
source: No logs yet
fr: Aucun journal pour l'instant
ko: 아직 로그가 없습니다

source: Load more logs
fr: Charger plus de journaux
ko: 로그 더 불러오기

# loadMoreLogsFailed
source: Failed to load more logs: {error}
fr: Échec du chargement de plus de journaux : {error}
ko: 로그 더 불러오기 실패: {error}

# logDetailsTitle
source: {level} Log {source}
fr: {level} Journal {source}
ko: {level} 로그 {source}

source: Copy All
fr: Tout copier
ko: 전체 복사

# timestamp
source: Time: {time}
fr: Heure : {time}
ko: 시간: {time}

source: Message:
ko: 메시지:

# errorLabel
source: Error:
fr: Erreur :
ko: 오류:

source: Stack Trace:
fr: Trace de pile :
ko: 스택 추적:

# logCopiedToClipboard
source: Log details copied to clipboard
fr: Détails du journal copiés dans le presse-papiers
ko: 로그 상세 정보가 클립보드에 복사됨

# containsError
source: Contains error information
fr: Contient des informations d'erreur
ko: 오류 정보 포함

# sourceFilter
source: Source: {source}
ko: 소스: {source}

# searchFilter
source: Search: {query}
fr: Recherche : {query}
ko: 검색: {query}

# clearAllFilters
source: Clear All
fr: Tout effacer
ko: 전체 지우기

source: Log Filter Options
fr: Options de filtre de journal
ko: 로그 필터 옵션

source: Reset
fr: Réinitialiser
ko: 초기화

source: Filter by Log Level
fr: Filtrer par niveau de journal
ko: 로그 레벨로 필터링

source: Filter by Source
fr: Filtrer par source
ko: 소스로 필터링

# enterSourceName
source: Enter log source name...
fr: Saisir le nom de la source du journal...
ko: 로그 소스 이름 입력...

source: Apply
fr: Appliquer
ko: 적용

# clearLogsTitle
source: Clear Logs
fr: Effacer les journaux
ko: 로그 지우기

# clearLogsQuestion
source: Which logs would you like to clear?
fr: Quels journaux souhaitez-vous effacer ?
ko: 어떤 로그를 지우시겠습니까?

source: Clear Memory Logs Only
fr: Effacer les journaux mémoire uniquement
ko: 메모리 로그만 지우기

source: Clear All Logs
fr: Effacer tous les journaux
ko: 모든 로그 지우기

source: Memory logs cleared
fr: Journaux mémoire effacés
ko: 메모리 로그 지워짐

source: All logs cleared
fr: Tous les journaux effacés
ko: 모든 로그 지워짐

# logsCount
source: {count, plural, =1{Showing 1 log} other{Showing {count} logs}} • Long press to copy • Tap for details
fr: {count, plural, =1{Affichage de 1 journal} other{Affichage de {count} journaux}} • Appui long pour copier • Appuyez pour les détails
ko: {count, plural, =1{1개 로그 표시 중} other{{count}개 로그 표시 중}} • 길게 눌러 복사 • 탭하여 상세 정보

# logPageError
source: Log page rendering error:
fr: Erreur de rendu de la page de journal :
ko: 로그 페이지 렌더링 오류:

source: Network Diagnostic
fr: Diagnostic réseau
ko: 네트워크 진단

# networkConfig
source: Network Configuration
fr: Configuration réseau
ko: 네트워크 구성

# networkDiagnosticSection
source: Network Diagnostic
fr: Diagnostic réseau
ko: 네트워크 진단

source: Diagnosing...
fr: Diagnostic en cours...
ko: 진단 중...

source: Run Network Diagnostic
fr: Exécuter le diagnostic réseau
ko: 네트워크 진단 실행

# diagnosticResult
source: Diagnostic result: {passed}/{total} passed
fr: Résultat du diagnostic : {passed}/{total} réussis
ko: 진단 결과: {passed}/{total} 통과

# diagnosticFailed
source: Diagnostic failed: {error}
fr: Échec du diagnostic : {error}
ko: 진단 실패: {error}

source: Device Discovery
fr: Découverte d'appareils
ko: 기기 검색

source: Start Discovery
fr: Démarrer la découverte
ko: 검색 시작

source: Stop Discovery
fr: Arrêter la découverte
ko: 검색 중지

source: Send Announcement
fr: Envoyer une annonce
ko: 알림 전송

source: Device announcement sent
fr: Annonce de l'appareil envoyée
ko: 기기 알림 전송됨

# startDiscoveryFailed
source: Failed to start device discovery: {error}
fr: Échec du démarrage de la découverte de l'appareil : {error}
ko: 기기 검색 시작 실패: {error}

# sendAnnouncementFailed
source: Failed to send device announcement: {error}
fr: Échec de l'envoi de l'annonce de l'appareil : {error}
ko: 기기 알림 전송 실패: {error}

source: Status: Running
fr: État : En cours d'exécution
ko: 상태: 실행 중

source: Status: Stopped
fr: État : Arrêté
ko: 상태: 중지됨

source: Discovered Devices
fr: Appareils découverts
ko: 검색된 기기

source: Discovered Devices ({count})
fr: Appareils découverts ({count})
ko: 검색된 기기 ({count})

source: No devices found
fr: Aucun appareil trouvé
ko: 기기 없음

source: Unknown model
fr: Modèle inconnu
ko: 알 수 없는 모델

# fingerprint
source: Fingerprint: {fingerprint}
fr: Empreinte : {fingerprint}
ko: 지문: {fingerprint}

# hitokotoTypeA
source: Anime
ko: 애니메이션

# hitokotoTypeB
source: Manga
ko: 만화

# hitokotoTypeC
source: Game
fr: Jeu
ko: 게임

# hitokotoTypeD
source: Literature
fr: Littérature
ko: 문학

# hitokotoTypeE
source: Original
ko: 오리지널

# hitokotoTypeF
source: From the web
fr: Du web
ko: 인터넷

# hitokotoTypeG
source: Other
fr: Autre
ko: 기타

# hitokotoTypeH
source: Movie & TV
fr: Cinéma & TV
ko: 영화 및 TV

# hitokotoTypeI
source: Poetry
fr: Poésie
ko: 시

# hitokotoTypeK
source: Philosophy
fr: Philosophie
ko: 철학

source: No network connection
fr: Pas de connexion réseau
ko: 네트워크 연결 없음

source: Unknown
fr: Inconnu
ko: 알 수 없음

# defaultQuote1
source: Life is not only about the present, but also poetry and distance.
fr: La vie n'est pas seulement le présent, mais aussi la poésie et le lointain.
ko: 인생은 현재뿐만 아니라 시와 먼 곳이기도 합니다.

# defaultQuote2
source: Life is like a journey, you don't have to care about the destination, what you care about is the scenery along the way.
fr: La vie est comme un voyage, il ne faut pas se soucier de la destination, ce qui compte c'est le paysage en chemin.
ko: 인생은 여행과 같아서 목적지에 신경 쓸 필요 없이 길 위의 풍경을 신경 써야 합니다.

# defaultQuote3
source: Don't wait for opportunity, create it.
fr: N'attendez pas l'opportunité, créez-la.
ko: 기회를 기다리지 말고 창조하세요.

# editTagTitle
source: Edit Tag
fr: Modifier l'étiquette
ko: 태그 편집

# tagNameLabel
source: Tag Name
fr: Nom de l'étiquette
ko: 태그 이름

# iconLabel
source: Icon:
fr: Icône :
ko: 아이콘:

source: Emotion
fr: Émotion
ko: 감정

source: Thinking
fr: Pensée
ko: 생각

source: Nature
ko: 자연

source: Mood
fr: Humeur
ko: 기분

source: Life
fr: Vie
ko: 인생

source: Growth
fr: Croissance
ko: 성장

source: Reward
fr: Récompense
ko: 보상

source: Transport
ko: 교통

# otherCategory
source: Other
fr: Autre
ko: 기타

# logLoadMoreError
source: Failed to load more logs: {error}
fr: Échec du chargement de plus de journaux : {error}
ko: 로그 더 불러오기 실패: {error}

# logLoadError
source: Failed to load logs
fr: Échec du chargement des journaux
ko: 로그 로드 실패

# logSourceFilter
source: Source: {source}
ko: 소스: {source}

# logSearchFilter
source: Search: {query}
fr: Recherche : {query}
ko: 검색: {query}

# logClearAllFilters
source: Clear All
fr: Tout effacer
ko: 전체 지우기

# logCopyAll
source: Copy All
fr: Tout copier
ko: 전체 복사

# logTimestamp
source: Time: {time}
fr: Heure : {time}
ko: 시간: {time}

# logMessage
source: Message:
ko: 메시지:

# logError
source: Error:
fr: Erreur :
ko: 오류:

# logStackTrace
source: Stack Trace:
fr: Trace de pile :
ko: 스택 추적:

# logCopied
source: Log details copied to clipboard
fr: Détails du journal copiés dans le presse-papiers
ko: 로그 상세 정보가 클립보드에 복사됨

# logFilterReset
source: Reset
fr: Réinitialiser
ko: 초기화

# logFilterByLevel
source: Filter by Log Level
fr: Filtrer par niveau de journal
ko: 로그 레벨로 필터링

# logFilterBySource
source: Filter by Source
fr: Filtrer par source
ko: 소스로 필터링

# logFilterSourceHint
source: Enter log source name...
fr: Saisir le nom de la source du journal...
ko: 로그 소스 이름 입력...

# logFilterApply
source: Apply
fr: Appliquer
ko: 적용

# logClearTitle
source: Clear Logs
fr: Effacer les journaux
ko: 로그 지우기

# logClearQuestion
source: Which logs would you like to clear?
fr: Quels journaux souhaitez-vous effacer ?
ko: 어떤 로그를 지우시겠습니까?

# logClearMemory
source: Clear Memory Logs Only
fr: Effacer les journaux mémoire uniquement
ko: 메모리 로그만 지우기

# logClearMemorySuccess
source: Memory logs cleared
fr: Journaux mémoire effacés
ko: 메모리 로그 지워짐

# logClearAll
source: Clear All Logs
fr: Effacer tous les journaux
ko: 모든 로그 지우기

# logClearAllSuccess
source: All logs cleared
fr: Tous les journaux effacés
ko: 모든 로그 지워짐

# logClearError
source: Failed to clear logs: {error}
fr: Échec de l'effacement des journaux : {error}
ko: 로그 지우기 실패: {error}

# logContainsError
source: Contains error information
fr: Contient des informations d'erreur
ko: 오류 정보 포함

# httpServerPort
source: HTTP Server Port: {port}
fr: Port du serveur HTTP : {port}
ko: HTTP 서버 포트: {port}

# multicastDiscoveryPort
source: Multicast Discovery Port: {port}
fr: Port de découverte multicast : {port}
ko: 멀티캐스트 검색 포트: {port}

# multicastAddress
source: Multicast Address: {address}
fr: Adresse multicast : {address}
ko: 멀티캐스트 주소: {address}

# protocolVersion
source: Protocol Version: {version}
fr: Version du protocole : {version}
ko: 프로토콜 버전: {version}

source: Test Analysis
fr: Analyse test
ko: 분석 테스트

# testAnalysisDesc
source: This is a test analysis to verify that the save function is working properly.
fr: Ceci est une analyse test pour vérifier que la fonction d'enregistrement fonctionne correctement.
ko: 이것은 저장 기능이 올바르게 작동하는지 확인하기 위한 테스트 분석입니다.

source: View History
fr: Voir l'historique
ko: 기록 보기

# saveAnalysisError
source: Failed to save analysis: {error}
fr: Échec de l'enregistrement de l'analyse : {error}
ko: 분석 저장 실패: {error}

# aiAnalysisSource
source: AI Analysis
fr: Analyse IA
ko: AI 분석

# savedAsNote
source: Saved as a new note
fr: Enregistré comme nouvelle note
ko: 새 노트로 저장됨

# saveAsNoteError
source: Failed to save as note: {error}
fr: Échec de l'enregistrement comme note : {error}
ko: 노트로 저장 실패: {error}

# shareError
source: Failed to share: {error}
fr: Échec du partage : {error}
ko: 공유 실패: {error}

# configureApiKey
source: Please configure the API Key in the settings first
fr: Veuillez d'abord configurer la clé API dans les paramètres
ko: 설정에서 먼저 API Key를 구성해 주세요

# noteListEmptyTitle
source: No notes yet, start journaling!
fr: Pas encore de note, commencez votre journal !
ko: 아직 노트가 없습니다. 기록을 시작해 보세요!

# noteSearchEmptyTitle
source: No related notes found
fr: Aucune note correspondante trouvée
ko: 관련 노트를 찾을 수 없습니다

# noteSearchEmptySubtitle
source: Try other keywords or check your spelling
fr: Essayez d'autres mots-clés ou vérifiez votre orthographe
ko: 다른 키워드를 시도하거나 철자를 확인해 주세요

# noteSearchTimeoutMessage
source: Search timed out, please retry
fr: La recherche a expiré, veuillez réessayer
ko: 검색 시간이 초과되었습니다. 다시 시도해 주세요

# searchingLabel
source: Searching
fr: Recherche en cours
ko: 검색 중

# filterAndSortTooltip
source: Filter/Sort
fr: Filtrer/Trier
ko: 필터/정렬

# noNotesFound
source: No notes found, please add some notes first
fr: Aucune note trouvée, veuillez ajouter quelques notes d'abord
ko: 노트를 찾을 수 없습니다. 먼저 노트를 추가해 주세요

# generateInsightsError
source: Failed to generate insights: {error}
fr: Échec de la génération des aperçus : {error}
ko: 인사이트 생성 실패: {error}

# serverInternalError
source: Server internal error, may be a model configuration issue
fr: Erreur interne du serveur, peut-être un problème de configuration du modèle
ko: 서버 내부 오류, 모델 구성 문제일 수 있습니다

source: Check Settings
fr: Vérifier les paramètres
ko: 설정 확인

# invalidApiKey
source: Invalid API key, please check the settings
fr: Clé API invalide, veuillez vérifier les paramètres
ko: 유효하지 않은 API Key, 설정을 확인해 주세요

source: Check API Key
fr: Vérifier la clé API
ko: API Key 확인

# rateLimitExceeded
source: Request frequency is too high, please try again later
fr: La fréquence des requêtes est trop élevée, veuillez réessayer plus tard
ko: 요청 빈도가 너무 높습니다. 나중에 다시 시도해 주세요

# tryLater
source: Try Again Later
fr: Réessayer plus tard
ko: 나중에 다시 시도

# generateInsightsSetupError
source: Failed to generate insights (setup): {error}
fr: Échec de la génération des aperçus (configuration) : {error}
ko: 인사이트 생성 실패 (설정): {error}

# serverInternalErrorConfig
source: Server internal error, please check if the AI model configuration is correct
fr: Erreur interne du serveur, veuillez vérifier si la configuration du modèle IA est correcte
ko: 서버 내부 오류, AI 모델 구성이 올바른지 확인해 주세요

# invalidApiKeyUpdate
source: Invalid API key, please update the API key in the settings
fr: Clé API invalide, veuillez mettre à jour la clé API dans les paramètres
ko: 유효하지 않은 API Key, 설정에서 API Key를 업데이트해 주세요

# configureValidApiKey
source: Please configure a valid API key in the settings first
fr: Veuillez d'abord configurer une clé API valide dans les paramètres
ko: 설정에서 먼저 유효한 API Key를 구성해 주세요

source: Regenerate
fr: Régénérer
ko: 재생성

source: Select Analysis Method
fr: Sélectionner la méthode d'analyse
ko: 분석 방법 선택

source: Advanced Options
fr: Options avancées
ko: 고급 옵션

# customPromptHint
source: e.g., Analyze the characters and locations mentioned in my notes
fr: par ex., Analyser les personnages et les lieux mentionnés dans mes notes
ko: 예: 내 노트에 언급된 인물과 장소를 분석해 줘

source: Analysis History Record
fr: Enregistrement de l'historique d'analyse
ko: 분석 기록 레코드

# viewPreviousAnalysis
source: View previous AI analysis results
fr: Voir les résultats d'analyse IA précédents
ko: 이전 AI 분석 결과 보기

# analysisDescriptionTitle
source: Analysis Description
fr: Description de l'analyse
ko: 분석 설명

# analysisDescription
source: AI analysis will synthesize all your note content to discover potential thinking patterns and regularities. You can choose different analysis styles to get diverse perspectives. This may take some time, please be patient.
fr: L'analyse IA synthétisera tout le contenu de vos notes pour découvrir des modèles de pensée et des régularités potentiels. Vous pouvez choisir différents styles d'analyse pour obtenir diverses perspectives. Cela peut prendre un certain temps, veuillez patienter.
ko: AI 분석은 모든 노트 내용을 종합하여 잠재적인 사고 패턴과 규칙성을 발견합니다. 다양한 분석 스타일을 선택하여 다양한 관점을 얻을 수 있습니다. 시간이 다소 걸릴 수 있으니 잠시만 기다려 주세요.

# aiAnalysisUsageInstructionsTitle
source: AI Analysis Usage Instructions
fr: Instructions d'utilisation de l'analyse IA
ko: AI 분석 사용 설명

# aiAnalysisUsageInstructions
source: 1. AI may generate inaccurate or misleading content, please evaluate the analysis results with caution 2. When using this feature, all your note information (including content, date, location, weather, and temperature, etc.) will be sent to the AI for comprehensive analysis 3. The analysis results are for reference only, and the final interpretation is up to you 4. It is recommended to use this feature in a good network environment to get the best experience
fr: 1. L'IA peut générer du contenu inexact ou trompeur, veuillez évaluer les résultats de l'analyse avec prudence 2. Lorsque vous utilisez cette fonctionnalité, toutes vos informations de note (y compris le contenu, la date, le lieu, la météo et la température, etc.) seront envoyées à l'IA pour une analyse complète 3. Les résultats de l'analyse sont à titre indicatif uniquement, et l'interprétation finale vous appartient 4. Il est recommandé d'utiliser cette fonctionnalité dans un bon environnement réseau pour obtenir la meilleure expérience
ko: 1. AI는 부정확하거나 오해의 소지가 있는 내용을 생성할 수 있으므로 분석 결과를 신중하게 평가해 주세요 2. 이 기능을 사용할 때 모든 노트 정보(내용, 날짜, 위치, 날씨, 기온 등)가 AI에 전송되어 종합적인 분석에 사용됩니다 3. 분석 결과는 참고용이며, 최종 해석은 사용자에게 달려 있습니다 4. 최상의 경험을 위해 양호한 네트워크 환경에서 이 기능을 사용하는 것을 권장합니다

source: Copy to Clipboard
fr: Copier dans le presse-papiers
ko: 클립보드에 복사

# analysisResultCopied
source: Analysis result copied to clipboard
fr: Résultat de l'analyse copié dans le presse-papiers
ko: 분석 결과가 클립보드에 복사됨

# saveAsNoteButton
source: Save as Note
fr: Enregistrer comme note
ko: 노트로 저장

# saveAnalysisButton
source: Save Analysis
fr: Enregistrer l'analyse
ko: 분석 저장

# shareInsightsButton
source: Share Insights
fr: Partager les aperçus
ko: 인사이트 공유

# generateInsightsErrorSnapshot
source: Error generating insights: {error}
fr: Erreur lors de la génération des aperçus : {error}
ko: 인사이트 생성 오류: {error}

# insightsPageEmpty
source: Select an analysis type and click "Start Analysis" Insights will help you discover thinking patterns and regularities in your notes
fr: Sélectionnez un type d'analyse et cliquez sur "Démarrer l'analyse" Les aperçus vous aideront à découvrir des modèles de pensée et des régularités dans vos notes
ko: 분석 유형을 선택하고 "분석 시작"을 클릭하세요 인사이트가 노트의 사고 패턴과 규칙성을 발견하도록 도와줍니다

source: Custom Analysis
fr: Analyse personnalisée
ko: 사용자 지정 분석

source: OpenAPI Compatible
fr: Compatible OpenAPI
ko: OpenAPI 호환

source: Verifying API Key...
fr: Vérification de la clé API...
ko: API Key 확인 중...

source: No provider selected
fr: Aucun fournisseur sélectionné
ko: 공급자가 선택되지 않음

# apiKeyValid
source: API Key valid ({length} characters)
fr: Clé API valide ({length} caractères)
ko: API Key 유효함 ({length}자)

# apiKeyInvalid
source: No valid API Key configured
fr: Aucune clé API valide configurée
ko: 유효한 API Key가 구성되지 않음

source: ❌ No AI provider selected
fr: ❌ Aucun fournisseur IA sélectionné
ko: ❌ AI 공급자가 선택되지 않음

source: ⚠️ Provider disabled
fr: ⚠️ Fournisseur désactivé
ko: ⚠️ 공급자 비활성화됨

# apiKeyVerified
source: ✅ API Key valid (verified)
fr: ✅ Clé API valide (vérifiée)
ko: ✅ API Key 유효함 (확인됨)

# apiKeyStatusCheck
source: API Key status check: {status}
fr: Vérification de l'état de la clé API : {status}
ko: API Key 상태 확인: {status}

# checkFailed
source: Check failed: {error}
fr: Échec de la vérification : {error}
ko: 확인 실패: {error}

# loadAiSettingsError
source: Failed to load AI settings: {error}
fr: Échec du chargement des paramètres IA : {error}
ko: AI 설정 로드 실패: {error}

# loadAiSettingsErrorUser
source: Failed to load AI settings, please check your network connection or restart the app
fr: Échec du chargement des paramètres IA, veuillez vérifier votre connexion réseau ou redémarrer l'application
ko: AI 설정을 로드하지 못했습니다. 네트워크 연결을 확인하거나 앱을 다시 시작해 주세요

# fixFormErrors
source: Please fix the errors in the form before saving
fr: Veuillez corriger les erreurs dans le formulaire avant d'enregistrer
ko: 저장하기 전에 양식의 오류를 수정해 주세요

# presetCreated
source: New preset created and saved successfully
fr: Nouveau préréglage créé et enregistré avec succès
ko: 새 프리셋이 생성되고 저장되었습니다

# saveSettingsError
source: Failed to save settings: {error}
fr: Échec de l'enregistrement des paramètres : {error}
ko: 설정 저장 실패: {error}

# customConfig
source: Custom Configuration
fr: Configuration personnalisée
ko: 사용자 지정 구성

# customConfigHost
source: Custom-{host}
fr: Personnalisé-{host}
ko: 사용자 지정-{host}

# customConfigTimestamp
source: Custom-{timestamp}
fr: Personnalisé-{timestamp}
ko: 사용자 지정-{timestamp}

source: Testing connection...
fr: Test de connexion...
ko: 연결 테스트 중...

# connectionTestSuccess
source: AI connection test successful!
fr: Test de connexion IA réussi !
ko: AI 연결 테스트 성공!

# connectionTestFailed
source: Connection test failed: {error}
fr: Échec du test de connexion : {error}
ko: 연결 테스트 실패: {error}

# apiKeyRequired
source: API Key is required for {providerName}
fr: La clé API est requise pour {providerName}
ko: {providerName}에 API Key가 필요합니다

# connectionSuccess
source: Connection successful
fr: Connexion réussie
ko: 연결 성공

source: Response format error
fr: Erreur de format de réponse
ko: 응답 형식 오류

# connectionFailed
source: Connection failed: {statusCode}
fr: Échec de la connexion : {statusCode}
ko: 연결 실패: {statusCode}

# switchedTo
source: Switched to {providerName}
fr: Basculé vers {providerName}
ko: {providerName}로 전환됨

source: Rename Preset
fr: Renommer le préréglage
ko: 프리셋 이름 변경

source: Preset Name
fr: Nom du préréglage
ko: 프리셋 이름

# presetRenamed
source: Preset has been renamed to "{result}"
fr: Le préréglage a été renommé en "{result}"
ko: 프리셋 이름이 "{result}"로 변경되었습니다

source: Delete Preset
fr: Supprimer le préréglage
ko: 프리셋 삭제

# deletePresetConfirm
source: Are you sure you want to delete the preset "{providerName}"? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer le préréglage "{providerName}" ? Cette action est irréversible.
ko: 프리셋 "{providerName}"을(를) 삭제하시겠습니까? 이 작업은 되돌릴 수 없습니다.

# presetDeleted
source: Preset "{providerName}" has been deleted
fr: Le préréglage "{providerName}" a été supprimé
ko: 프리셋 "{providerName}"이(가) 삭제되었습니다

source: AI Provider Selection
fr: Sélection du fournisseur IA
ko: AI 공급자 선택

# currentProvider
source: Current: {providerName}
fr: Actuel : {providerName}
ko: 현재: {providerName}

# modelLabel
source: Model: {model}
fr: Modèle : {model}
ko: 모델: {model}

# modelNotConfigured
source: Not configured
fr: Non configuré
ko: 구성되지 않음

source: Check API Key Status
fr: Vérifier l'état de la clé API
ko: API Key 상태 확인

# savedPresets
source: Saved Presets ({length}):
fr: Préréglages enregistrés ({length}) :
ko: 저장된 프리셋 ({length}):
