Repository: Shangjin-Xiao/ThoughtEcho
Catalog: lib/l10n/app_*.arb
Languages: fr, ko, zh

source: Cancel
fr: Annuler
ko: 취소
zh: 取消

source: Confirm
fr: Confirmer
ko: 확인
zh: 确定

source: Delete
fr: Supprimer
ko: 삭제
zh: 删除

source: Save
fr: Enregistrer
ko: 저장
zh: 保存

source: Edit
fr: Modifier
ko: 편집
zh: 编辑

source: Search
fr: Rechercher
ko: 검색
zh: 搜索

source: Settings
fr: Paramètres
ko: 설정
zh: 设置

source: Loading...
fr: Chargement...
ko: 로딩 중...
zh: 加载中...

source: Retry
fr: Réessayer
ko: 재시도
zh: 重试

source: Refresh
fr: Actualiser
ko: 새로고침

source: Annual Report
fr: Rapport annuel
ko: 연간 보고서

source: Clear records
fr: Effacer les enregistrements
ko: 기록 지우기

source: Home
fr: Accueil
ko: 홈
zh: 首页

source: Notes
ko: 노트
zh: 记录

# languageSettings
source: Language
fr: Langue
ko: 언어
zh: 语言 / Language

# languageFollowSystem
source: Follow System
fr: Suivre le système
ko: 시스템 설정 따름
zh: 跟随系统 / Follow System

# languageChinese
source: 简体中文
ko: 중국어(간체)

# languageEnglish
source: English
ko: 영어

source: Select Language
fr: Sélectionner la langue
ko: 언어 선택
zh: 选择语言 / Select Language

# onboardingSelectLanguage
source: Select Language
fr: Sélectionner la langue
ko: 언어 선택

# onboardingWelcome
source: Welcome to ThoughtEcho
fr: Bienvenue sur ThoughtEcho
ko: ThoughtEcho에 오신 것을 환영합니다
zh: 欢迎使用心迹

# onboardingSubtitle
source: Your Personal Inspiration Notebook with AI Power
fr: Votre carnet d'inspiration personnel propulsé par l'IA
ko: AI 기반의 개인 영감 노트
zh: 你的专属灵感摘录本

# onboardingDescription
source: Let's record together
fr: Enregistrons ensemble
ko: 함께 기록해 보아요
zh: 让我们一起随心记录

# onboardingCoreFeatures
source: Core Features
fr: Fonctionnalités principales
ko: 핵심 기능
zh: 核心功能

# onboardingDiscoverFeatures
source: Discover the power of ThoughtEcho
fr: Découvrez la puissance de ThoughtEcho
ko: ThoughtEcho의 강력한 기능을 발견하세요
zh: 发现心迹的强大能力

# onboardingPersonalization
source: Personalization
fr: Personnalisation
ko: 개인화
zh: 个性化设置

# onboardingCustomizeExperience
source: Customize your experience
fr: Personnalisez votre expérience
ko: 나만의 경험을 맞춤 설정하세요
zh: 定制您的专属体验

# onboardingModifyLater
source: These settings can be modified anytime in the app
fr: Ces paramètres peuvent être modifiés à tout moment dans l'application
ko: 이 설정들은 앱 내에서 언제든지 변경할 수 있습니다
zh: 这些设置可以随时在应用中修改

# onboardingComplete
source: Setup Complete
fr: Configuration terminée
ko: 설정 완료
zh: 设置完成

# onboardingAllSet
source: You have completed all settings Now you can start recording your thoughts
fr: Vous avez terminé tous les réglages Vous pouvez maintenant commencer à enregistrer vos pensées
ko: 모든 설정이 완료되었습니다 이제 당신의 생각을 기록해 보세요
zh: 您已完成所有设置 现在可以开始记录您的思想

# onboardingStartJourney
source: Let's start the journey together
fr: Commençons le voyage ensemble
ko: 함께 여정을 시작해 봅시다
zh: 让我们一起随心记录

# onboardingSkip
source: Skip
fr: Passer
ko: 건너뛰기
zh: 跳过

# onboardingNext
source: Next
fr: Suivant
ko: 다음
zh: 下一步

# onboardingPrevious
source: Previous
fr: Précédent
ko: 이전
zh: 上一步

# onboardingStart
source: Get Started
fr: Commencer
ko: 시작하기
zh: 开始使用

# onboardingPreparing
source: Preparing...
fr: Préparation...
ko: 준비 중...
zh: 正在准备...

# onboardingSkipTitle
source: Skip Onboarding
fr: Passer l'introduction
ko: 온보딩 건너뛰기
zh: 跳过引导

# onboardingSkipMessage
source: Are you sure you want to skip the onboarding? Some settings will use default values.
fr: Êtes-vous sûr de vouloir passer l'introduction ? Certains paramètres utiliseront les valeurs par défaut.
ko: 온보딩을 건너뛰시겠습니까? 일부 설정은 기본값으로 적용됩니다.
zh: 确定要跳过引导直接进入应用吗？ 部分设置将使用默认值。

# onboardingConfirmSkip
source: Confirm Skip
fr: Confirmer le saut
ko: 건너뛰기 확인
zh: 确定跳过

# onboardingInitializing
source: Initializing...
fr: Initialisation...
ko: 초기화 중...
zh: 正在初始化...

# onboardingInitFailed
source: Initialization failed, please retry
fr: L'initialisation a échoué, veuillez réessayer
ko: 초기화 실패, 다시 시도해 주세요
zh: 初始化失败，请重试

# onboardingContinueUsing
source: Continue
fr: Continuer
ko: 계속하기
zh: 继续使用

# onboardingError
source: Something went wrong
fr: Une erreur est survenue
ko: 문제가 발생했습니다
zh: 出现问题

# onboardingUpdateComplete
source: Update Complete
fr: Mise à jour terminée
ko: 업데이트 완료
zh: 更新完成

# onboardingUpdateSuccess
source: ThoughtEcho has been successfully updated Your data has been automatically migrated
fr: ThoughtEcho a été mis à jour avec succès Vos données ont été migrées automatiquement
ko: ThoughtEcho가 성공적으로 업데이트되었습니다 데이터가 자동으로 마이그레이션되었습니다
zh: 心迹已成功更新到新版本 数据已自动迁移，无需手动操作

# onboardingEnterApp
source: Enter App
fr: Entrer dans l'application
ko: 앱 진입
zh: 进入应用

# onboardingQuickTip1
source: Single tap on Daily Quote to copy content
fr: Appuyez une fois sur la Citation du jour pour copier le contenu
ko: 오늘의 명언을 한 번 탭하면 복사됩니다

# onboardingQuickTip2
source: Double tap on Daily Quote to quickly add to notes
fr: Appuyez deux fois sur la Citation du jour pour l'ajouter rapidement aux notes
ko: 오늘의 명언을 두 번 탭하면 노트에 빠르게 추가됩니다

# onboardingQuickTip3
source: Use tags to organize your notes
fr: Utilisez des étiquettes pour organiser vos notes
ko: 태그를 사용하여 노트를 정리하세요

# onboardingQuickTip4
source: Full-text search to quickly find content
fr: Recherche plein texte pour trouver rapidement du contenu
ko: 전문 검색으로 내용을 빠르게 찾으세요

# featureSmartNotes
source: Smart Notes
fr: Notes intelligentes
ko: 스마트 노트
zh: 智能笔记

# featureSmartNotesDesc
source: Rich text editing with automatic time, location and weather recording
fr: Édition de texte enrichi avec enregistrement automatique de l'heure, du lieu et de la météo
ko: 시간, 위치, 날씨가 자동으로 기록되는 서식 있는 텍스트 편집
zh: 支持富文本编辑，自动记录时间、位置和天气

# featureDailyQuote
source: Daily Quote
fr: Citation du jour
ko: 오늘의 명언
zh: 每日一言

# featureDailyQuoteDesc
source: Selected quotes to inspire your day
fr: Citations sélectionnées pour inspirer votre journée
ko: 하루의 영감을 주는 엄선된 명언
zh: 精选名言警句，为您的一天带来灵感启发

# featureAiInsight
source: AI Insight
fr: Aperçu IA
ko: AI 인사이트
zh: AI 洞察

# featureAiInsightDesc
source: Intelligent analysis of your notes to discover thinking patterns and emotional changes
fr: Analyse intelligente de vos notes pour découvrir des modèles de pensée et des changements émotionnels
ko: 노트를 지능적으로 분석하여 사고 패턴과 감정 변화를 발견합니다
zh: 智能分析您的笔记内容，发现思维模式和情感变化

# featureLocalFirst
source: Local First
fr: Local d'abord
ko: 로컬 우선
zh: 本地优先

# featureLocalFirstDesc
source: All data stored on your device for privacy and security
fr: Toutes les données sont stockées sur votre appareil pour la confidentialité et la sécurité
ko: 개인정보 보호와 보안을 위해 모든 데이터는 기기에 저장됩니다
zh: 所有数据存储在您的设备上，确保隐私安全

# prefLanguage
source: Language
fr: Langue
ko: 언어
zh: 语言 / Language

# prefLanguageDesc
source: Select app display language
fr: Sélectionner la langue d'affichage de l'application
ko: 앱 표시 언어 선택
zh: 选择应用显示语言

# prefDailyQuoteType
source: Daily Quote Types
fr: Types de citation du jour
ko: 명언 유형
zh: 每日一言类型

# prefDailyQuoteTypeDesc
source: Select content types you are interested in
fr: Sélectionnez les types de contenu qui vous intéressent
ko: 관심 있는 콘텐츠 유형을 선택하세요
zh: 选择您感兴趣的内容类型

# prefLocationService
source: Location Service
fr: Service de localisation
ko: 위치 서비스
zh: 位置服务

# prefLocationServiceDesc
source: Enable location service to record note locations and get weather info
fr: Activez le service de localisation pour enregistrer les lieux des notes et obtenir des informations météo
ko: 위치 서비스를 활성화하여 노트 위치와 날씨 정보를 기록합니다
zh: 启用位置服务以自动记录笔记地点和获取天气信息

# prefDefaultStartPage
source: Default Start Page
fr: Page de démarrage par défaut
ko: 기본 시작 페이지
zh: 默认启动页面

# prefDefaultStartPageDesc
source: Select the page to show when opening the app
fr: Sélectionnez la page à afficher à l'ouverture de l'application
ko: 앱을 열 때 표시할 페이지를 선택하세요
zh: 选择打开应用时首先看到的页面

# prefHomeOverview
source: Home Overview
fr: Aperçu de l'accueil
ko: 홈 개요
zh: 主页概览

# prefHomeOverviewDesc
source: View daily quote and recent notes
fr: Voir la citation du jour et les notes récentes
ko: 오늘의 명언 및 최근 노트 보기
zh: 查看每日一言和最近笔记

# prefNoteList
source: Note List
fr: Liste des notes
ko: 노트 목록
zh: 笔记列表

# prefNoteListDesc
source: Go directly to note management
fr: Aller directement à la gestion des notes
ko: 노트 관리로 바로 이동
zh: 直接进入笔记管理界面

# prefSelectAll
source: Select All
fr: Tout sélectionner
ko: 전체 선택
zh: 全选

# prefClearAll
source: Clear
fr: Effacer
ko: 지우기
zh: 清空

# prefAboutSettings
source: About Settings
fr: À propos des paramètres
ko: 설정 정보
zh: 关于设置

# prefAboutSettingsInfo
source: • All settings can be modified in the app settings anytime • We value your privacy, all data is stored on your device • Permissions will be requested when you need related features
fr: • Tous les paramètres peuvent être modifiés dans l'application à tout moment • Nous respectons votre vie privée, toutes les données sont stockées sur votre appareil • Les permissions seront demandées lorsque vous aurez besoin des fonctionnalités associées
ko: • 모든 설정은 앱 설정에서 언제든지 수정할 수 있습니다 • 우리는 개인정보를 소중히 여기며, 모든 데이터는 기기에 저장됩니다 • 관련 기능이 필요할 때 권한을 요청합니다
zh: • 所有设置都可以随时在应用的设置页面中修改 • 我们重视您的隐私，所有数据都存储在您的设备上 • 权限将在您需要使用相关功能时请求

# prefMoreOptionsHint
source: More personalization options and AI features available in Settings > Preferences.
fr: Plus d'options de personnalisation et de fonctionnalités IA disponibles dans Paramètres > Préférences.
ko: 더 많은 개인화 옵션과 AI 기능은 설정 > 환경설정에서 사용할 수 있습니다.
zh: 更多个性化选项和AI功能可在「设置 > 偏好设置」中随时调整。

# settingsTitle
source: Settings
fr: Paramètres
ko: 설정
zh: 设置

# settingsLocationWeather
source: Location & Weather Settings
fr: Paramètres de localisation et météo
ko: 위치 및 날씨 설정
zh: 位置与天气设置

# settingsUseLocationService
source: Use Location Service
fr: Utiliser le service de localisation
ko: 위치 서비스 사용
zh: 使用位置服务

# settingsLocationEnabled
source: Permission granted and enabled
fr: Permission accordée et activée
ko: 권한 허용 및 활성화됨
zh: 已获得权限并启用

# settingsLocationPermissionOnly
source: Permission granted but service disabled
fr: Permission accordée mais service désactivé
ko: 권한은 허용되었으나 서비스가 비활성화됨
zh: 已获得权限但服务未启用

# settingsLocationNoPermission
source: No location permission
fr: Pas de permission de localisation
ko: 위치 권한 없음
zh: 未获得位置权限

# settingsSetLocation
source: Set Display Location
fr: Définir le lieu d'affichage
ko: 표시 위치 설정
zh: 设置显示位置

# settingsSearchCity
source: Search and Select City
fr: Rechercher et sélectionner une ville
ko: 도시 검색 및 선택
zh: 搜索并选择城市

# settingsCurrentLocation
source: Current Display Location
fr: Lieu d'affichage actuel
ko: 현재 표시 위치
zh: 当前显示位置

# settingsNotSet
source: Not Set
fr: Non défini
ko: 설정되지 않음
zh: 未设置

# settingsAppSettings
source: App Settings
fr: Paramètres de l'application
ko: 앱 설정
zh: 应用设置

# settingsPreferences
source: Preferences
fr: Préférences
ko: 환경설정
zh: 偏好设置

# settingsPreferencesDesc
source: Personalization and AI features
fr: Personnalisation et fonctionnalités IA
ko: 개인화 및 AI 기능
zh: 个性化选项与AI功能

# settingsDefaultStartPage
source: Default Start Page
fr: Page de démarrage par défaut
ko: 기본 시작 페이지
zh: 默认启动页面

# settingsStartPageHome
source: Home (Daily Quote)
fr: Accueil (Citation du jour)
ko: 홈 (오늘의 명언)
zh: 首页（每日一言）

# settingsStartPageNotes
source: Notes (Note List)
fr: Notes (Liste des notes)
ko: 노트 (노트 목록)
zh: 记录（笔记列表）

# settingsSelectStartPage
source: Select Default Start Page
fr: Sélectionner la page de démarrage par défaut
ko: 기본 시작 페이지 선택
zh: 选择默认启动页面

# settingsTheme
source: Theme Settings
fr: Paramètres du thème
ko: 테마 설정
zh: 主题设置

# settingsThemeDesc
source: Customize app appearance
fr: Personnaliser l'apparence de l'application
ko: 앱 모양 사용자 지정
zh: 自定义应用的外观主题

# settingsAI
source: AI Settings
fr: Paramètres IA
ko: AI 설정
zh: AI设置

# settingsAIDesc
source: Configure AI API settings and multi-provider management
fr: Configurer les paramètres de l'API IA et la gestion multi-fournisseurs
ko: AI API 설정 및 다중 공급자 관리 구성
zh: 配置AI分析所需的API信息和多服务商管理

# settingsHitokoto
source: Quote Settings
fr: Paramètres des citations
ko: 명언 설정
zh: 一言设置

# settingsHitokotoDesc
source: Customize daily quote types
fr: Personnaliser les types de citation du jour
ko: 오늘의 명언 유형 사용자 지정
zh: 自定义「每日一言」的类型

# settingsLogs
source: Log Settings
fr: Paramètres des journaux
ko: 로그 설정
zh: 日志设置

# settingsLogsDesc
source: Configure app logging level
fr: Configurer le niveau de journalisation de l'application
ko: 앱 로깅 수준 구성
zh: 配置应用日志记录级别

# settingsStorage
source: Storage Management
fr: Gestion du stockage
ko: 저장소 관리
zh: 存储管理

# settingsStorageDesc
source: View storage usage, clean cache and unused files
fr: Voir l'utilisation du stockage, nettoyer le cache et les fichiers inutilisés
ko: 저장소 사용량 확인, 캐시 및 미사용 파일 정리
zh: 查看存储占用，清理缓存与无用文件

# settingsContentManagement
source: Content Management
fr: Gestion du contenu
ko: 콘텐츠 관리
zh: 内容管理

# settingsTags
source: Tag Management
fr: Gestion des étiquettes
ko: 태그 관리
zh: 标签管理

# settingsTagsDesc
source: Add, edit or delete note tags
fr: Ajouter, modifier ou supprimer des étiquettes de note
ko: 노트 태그 추가, 편집 또는 삭제
zh: 添加、编辑或删除笔记标签

# settingsBackup
source: Backup & Restore
fr: Sauvegarde et restauration
ko: 백업 및 복원
zh: 备份与恢复

# settingsBackupDesc
source: Backup data or restore from backup
fr: Sauvegarder les données ou restaurer à partir d'une sauvegarde
ko: 데이터 백업 또는 백업에서 복원
zh: 备份数据或从备份中恢复

# settingsSync
source: Note Sync
fr: Synchronisation des notes
ko: 노트 동기화
zh: 笔记同步

# settingsSyncDesc
source: Sync notes with nearby devices
fr: Synchroniser les notes avec les appareils à proximité
ko: 주변 기기와 노트 동기화
zh: 与附近设备同步笔记数据

# settingsAbout
source: About ThoughtEcho
fr: À propos de ThoughtEcho
ko: ThoughtEcho 정보
zh: 关于 心迹 (ThoughtEcho)

# settingsAboutSlogan
source: Your Personal Inspiration Notebook with AI Power
fr: Votre carnet d'inspiration personnel propulsé par l'IA
ko: AI 기반의 개인 영감 노트
zh: 你的专属灵感摘录本

# settingsViewSource
source: View Source Code (GitHub)
fr: Voir le code source (GitHub)
ko: 소스 코드 보기 (GitHub)
zh: 查看项目源码 (GitHub)

# settingsVisitWebsite
source: Visit Website
fr: Visiter le site web
ko: 웹사이트 방문
zh: 访问官网

# settingsViewLicenses
source: View Licenses
fr: Voir les licences
ko: 라이선스 보기
zh: 查看许可证信息

# settingsCheckUpdate
source: Check for Updates
fr: Vérifier les mises à jour
ko: 업데이트 확인
zh: 检查更新

# settingsCheckUpdateDesc
source: Check if a new version is available
fr: Vérifier si une nouvelle version est disponible
ko: 새 버전이 있는지 확인
zh: 检查是否有新版本可用

# settingsClose
source: Close
fr: Fermer
ko: 닫기
zh: 关闭

# locationPermissionDenied
source: Location permission denied, cannot enable location service
fr: Permission de localisation refusée, impossible d'activer le service de localisation
ko: 위치 권한이 거부되어 위치 서비스를 활성화할 수 없습니다
zh: 位置权限被拒绝，无法启用位置服务

# enableLocationService
source: Please Enable Location Service
fr: Veuillez activer le service de localisation
ko: 위치 서비스를 활성화해 주세요
zh: 请启用位置服务

# enableLocationServiceDesc
source: ThoughtEcho needs access to your location to provide weather and other features. Please enable location service in system settings.
fr: ThoughtEcho a besoin d'accéder à votre position pour fournir la météo et d'autres fonctionnalités. Veuillez activer le service de localisation dans les paramètres système.
ko: ThoughtEcho는 날씨 및 기타 기능을 제공하기 위해 위치 접근 권한이 필요합니다. 시스템 설정에서 위치 서비스를 활성화해 주세요.
zh: 心迹需要访问您的位置以提供天气等功能。请在系统设置中启用位置服务。

source: Go to Settings
fr: Aller aux paramètres
ko: 설정으로 이동
zh: 去设置

source: Getting location...
fr: Obtention de la localisation...
ko: 위치 가져오는 중...
zh: 正在获取位置...

# locationServiceEnabled
source: Location service enabled, location updated
fr: Service de localisation activé, position mise à jour
ko: 위치 서비스 활성화됨, 위치 업데이트됨
zh: 位置服务已启用，位置已更新

source: Location service disabled
fr: Service de localisation désactivé
ko: 위치 서비스 비활성화됨
zh: 位置服务已禁用

# cannotGetLocation
source: Cannot get current location
fr: Impossible d'obtenir la position actuelle
ko: 현재 위치를 가져올 수 없음
zh: 无法获取当前位置

# selectedCount
source: {count} types selected
fr: {count} types sélectionnés
ko: {count}개 유형 선택됨
zh: 已选择 {count} 种类型

source: Please wait...
fr: Veuillez patienter...
ko: 잠시만 기다려 주세요...
zh: 请稍候...

source: Close
fr: Fermer
ko: 닫기
zh: 关闭

source: OK
ko: 확인
zh: 好的

source: Error
fr: Erreur
ko: 오류
zh: 错误

source: Success
fr: Succès
ko: 성공
zh: 成功

source: Warning
fr: Avertissement
ko: 경고
zh: 警告

source: Info
ko: 정보
zh: 信息

# cannotOpenLink
source: Cannot open link: {url}
fr: Impossible d'ouvrir le lien : {url}
ko: 링크를 열 수 없음: {url}
zh: 无法打开链接: {url}

# checkUpdateFailed
source: Check update failed: {error}
fr: Échec de la vérification de mise à jour : {error}
ko: 업데이트 확인 실패: {error}
zh: 检查更新失败: {error}

source: Cannot get location permission
fr: Impossible d'obtenir la permission de localisation
ko: 위치 권한을 얻을 수 없음
zh: 无法获取位置权限

source: Log Debug Info
fr: Journaliser les infos de débogage
ko: 디버그 정보 기록
zh: 日志调试信息

# logDebugInfoDesc
source: Show log database status and path info
fr: Afficher l'état de la base de données des journaux et les informations de chemin
ko: 로그 데이터베이스 상태 및 경로 정보 표시
zh: 显示日志数据库状态和路径信息

source: Database Status:
fr: État de la base de données :
ko: 데이터베이스 상태:
zh: 数据库状态:

source: Log Statistics:
fr: Statistiques des journaux :
ko: 로그 통계:
zh: 日志统计:

# getDebugInfoFailed
source: Failed to get debug info: {error}
fr: Échec de l'obtention des infos de débogage : {error}
ko: 디버그 정보를 가져오지 못했습니다: {error}
zh: 获取调试信息失败: {error}

# generatingAIReport
source: Generating AI annual report...
fr: Génération du rapport annuel IA...
ko: AI 연간 보고서 생성 중...
zh: 正在生成AI年度报告...

# generateReportFailed
source: Failed to generate annual report
fr: Échec de la génération du rapport annuel
ko: 연간 보고서 생성 실패
zh: 生成年度报告失败

# aiReturnedEmpty
source: AI returned empty content, please retry
fr: L'IA a renvoyé un contenu vide, veuillez réessayer
ko: AI가 빈 내용을 반환했습니다. 다시 시도해 주세요
zh: AI返回了空内容，请重试

# pleaseConfigureApiKey
source: Please configure a valid API Key in AI settings first
fr: Veuillez d'abord configurer une clé API valide dans les paramètres IA
ko: AI 설정에서 먼저 유효한 API Key를 구성해 주세요
zh: 请先在AI设置中配置有效的API Key

# networkError
source: Network error, please check your connection and retry
fr: Erreur réseau, veuillez vérifier votre connexion et réessayer
ko: 네트워크 오류, 연결을 확인하고 다시 시도해 주세요
zh: 网络连接异常，请检查网络后重试

# aiQuotaExceeded
source: AI service quota exceeded, please try again later
fr: Quota de service IA dépassé, veuillez réessayer plus tard
ko: AI 서비스 할당량이 초과되었습니다. 나중에 다시 시도해 주세요
zh: AI服务配额不足，请稍后重试

# generateAIReportFailed
source: Failed to generate AI annual report
fr: Échec de la génération du rapport annuel IA
ko: AI 연간 보고서 생성 실패
zh: 生成AI年度报告失败

# getDataFailed
source: Failed to get data
fr: Échec de l'obtention des données
ko: 데이터 가져오기 실패
zh: 获取数据失败

# testingAIReport
source: Testing AI annual report...
fr: Test du rapport annuel IA...
ko: AI 연간 보고서 테스트 중...
zh: 正在测试AI年度报告...

source: Test Result
fr: Résultat du test
ko: 테스트 결과
zh: 测试结果

# contentLength
source: Content length: {length} characters
fr: Longueur du contenu : {length} caractères
ko: 콘텐츠 길이: {length}자
zh: 内容长度：{length}字符

# htmlFormat
source: HTML format: {status}
fr: Format HTML : {status}
ko: HTML 형식: {status}
zh: HTML格式：{status}

# jsonFormat
source: JSON format: {status}
fr: Format JSON : {status}
ko: JSON 형식: {status}
zh: JSON格式：{status}

# containsHtmlTags
source: Contains HTML tags: {status}
fr: Contient des balises HTML : {status}
ko: HTML 태그 포함: {status}
zh: 包含HTML标签：{status}

# first100Chars
source: First 100 characters:
fr: 100 premiers caractères :
ko: 첫 100자:
zh: 前100字符：

source: View Report
fr: Voir le rapport
ko: 보고서 보기
zh: 查看报告

# testFailed
source: Test failed: {error}
fr: Échec du test : {error}
ko: 테스트 실패: {error}
zh: 测试失败：{error}

# testFailedEmpty
source: Test failed: AI returned empty content
fr: Échec du test : L'IA a renvoyé un contenu vide
ko: 테스트 실패: AI가 빈 내용을 반환했습니다
zh: 测试失败：AI返回了空内容

# testFailedApiKey
source: Test failed: Please configure a valid API Key in AI settings first
fr: Échec du test : Veuillez d'abord configurer une clé API valide dans les paramètres IA
ko: 테스트 실패: AI 설정에서 먼저 유효한 API Key를 구성해 주세요
zh: 测试失败：请先在AI设置中配置有效的API Key

# testFailedNetwork
source: Test failed: Network error
fr: Échec du test : Erreur réseau
ko: 테스트 실패: 네트워크 오류
zh: 测试失败：网络连接异常

# testInitFailed
source: Test initialization failed
fr: Échec de l'initialisation du test
ko: 테스트 초기화 실패
zh: 测试初始化失败

source: Follow System
fr: Suivre le système
ko: 시스템 따름
zh: 跟随系统

# navHome
source: Home
fr: Accueil
ko: 홈
zh: 首页

# navNotes
source: Notes
ko: 노트
zh: 记录

# navInsights
source: Insights
fr: Aperçus
ko: 인사이트
zh: 洞察

# navSettings
source: Settings
fr: Paramètres
ko: 설정
zh: 设置

# appTitleOffline
source: ThoughtEcho - Offline
fr: ThoughtEcho - Hors ligne
ko: ThoughtEcho - 오프라인
zh: 心迹 - 无网络

source: Loading data, please wait...
fr: Chargement des données, veuillez patienter...
ko: 데이터 로딩 중, 잠시만 기다려 주세요...
zh: 正在加载数据，请稍等...

source: No tags available
fr: Aucune étiquette disponible
ko: 사용 가능한 태그 없음
zh: 暂无标签数据

source: Delete Note
fr: Supprimer la note
ko: 노트 삭제
zh: 删除笔记

# deleteNoteConfirmation
source: Are you sure you want to delete this note? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer cette note ? Cette action est irréversible.
ko: 이 노트를 삭제하시겠습니까? 이 작업은 되돌릴 수 없습니다.
zh: 确定要删除这条笔记吗？此操作无法撤销。

source: Note deleted
fr: Note supprimée
ko: 노트가 삭제되었습니다
zh: 笔记已删除

# favorited
source: Favorited ({count})
fr: Favoris ({count})
ko: 즐겨찾기됨 ({count})
zh: 已珍藏 ({count})

# favoriteFailed
source: Failed to favorite, please try again
fr: Échec de l'ajout aux favoris, veuillez réessayer
ko: 즐겨찾기 실패, 다시 시도해 주세요
zh: 收藏失败，请重试

source: AI card service not initialized
fr: Service de carte IA non initialisé
ko: AI 카드 서비스가 초기화되지 않음
zh: AI卡片服务未初始化

# generateCardFailed
source: Failed to generate card: {error}
fr: Échec de la génération de la carte : {error}
ko: 카드 생성 실패: {error}
zh: 生成卡片失败: {error}

source: Generating share image...
fr: Génération de l'image de partage...
ko: 공유 이미지 생성 중...
zh: 正在生成分享图片...

source: Card shared successfully
fr: Carte partagée avec succès
ko: 카드가 성공적으로 공유되었습니다
zh: 卡片分享成功

# shareFailed
source: Share failed: {error}
fr: Échec du partage : {error}
ko: 공유 실패: {error}
zh: 分享失败: {error}

source: Saving card to gallery...
fr: Enregistrement de la carte dans la galerie...
ko: 카드를 갤러리에 저장 중...
zh: 正在保存卡片到相册...

# cardSavedToGallery
source: Card saved to gallery: {path}
fr: Carte enregistrée dans la galerie : {path}
ko: 카드가 갤러리에 저장되었습니다: {path}
zh: 卡片已保存到相册: {path}

# saveFailed
source: Save failed: {error}
fr: Échec de l'enregistrement : {error}
ko: 저장 실패: {error}
zh: 保存失败: {error}

source: View
fr: Voir
ko: 보기
zh: 查看

# todayThoughts
source: Today's Thoughts
fr: Pensées du jour
ko: 오늘의 생각
zh: 今日思考

# loadingTodayThoughts
source: Loading today's thoughts...
fr: Chargement des pensées du jour...
ko: 오늘의 생각 로딩 중...
zh: 正在加载今日思考...

source: Fetching default prompt...
fr: Récupération de l'invite par défaut...
ko: 기본 프롬프트 가져오는 중...
zh: 正在获取默认提示...

# waitingForTodayThoughts
source: Waiting for today's thoughts...
fr: En attente des pensées du jour...
ko: 오늘의 생각을 기다리는 중...
zh: 等待今日思考...

# noTodayThoughts
source: No thoughts for today
fr: Aucune pensée pour aujourd'hui
ko: 오늘의 생각이 없습니다
zh: 暂无今日思考

# cannotOpenFullEditor
source: Cannot open full editor: {error}
fr: Impossible d'ouvrir l'éditeur complet : {error}
ko: 전체 편집기를 열 수 없음: {error}
zh: 无法打开全屏编辑器: {error}

# refreshFailed
source: Refresh failed: {error}
fr: Échec de l'actualisation : {error}
ko: 새로고침 실패: {error}
zh: 刷新失败: {error}

# backupAndRestore
source: Backup & Restore
fr: Sauvegarde et restauration
ko: 백업 및 복원
zh: 数据备份与还原

source: Data Backup
fr: Sauvegarde des données
ko: 데이터 백업
zh: 数据备份

source: Data Restore
fr: Restauration des données
ko: 데이터 복원
zh: 数据还原

source: Include media files
fr: Inclure les fichiers multimédias
ko: 미디어 파일 포함
zh: 包含媒体文件

source: Creating backup...
fr: Création de la sauvegarde...
ko: 백업 생성 중...
zh: 正在备份...

source: Create Backup
fr: Créer une sauvegarde
ko: 백업 생성
zh: 创建备份

source: Select backup file to restore
fr: Sélectionner le fichier de sauvegarde à restaurer
ko: 복원할 백업 파일 선택
zh: 选择备份文件还原

source: Important Notes
fr: Notes importantes
ko: 중요 알림
zh: 重要提示

source: Data Security
fr: Sécurité des données
ko: 데이터 보안
zh: 数据安全
