Repository: Shangjin-Xiao/ThoughtEcho
Catalog: lib/l10n/app_*.arb
Languages: fr, ko, zh

# dataSafetyDesc
source: Restoring data will overwrite all current data. Please make sure to backup your current data first
fr: La restauration des données écrasera toutes les données actuelles. Veuillez vous assurer de sauvegarder vos données actuelles d'abord
ko: 데이터를 복원하면 현재 모든 데이터가 덮어씌워집니다. 현재 데이터를 먼저 백업해 두시기 바랍니다.
zh: 还原数据将覆盖当前所有数据，请在还原前确保当前数据已备份

source: Backup Advice
fr: Conseil de sauvegarde
ko: 백업 권장
zh: 备份建议

# backupAdviceDesc
source: It's recommended to backup data regularly to multiple locations (local, cloud storage, etc.)
fr: Il est recommandé de sauvegarder régulièrement les données à plusieurs endroits (local, stockage cloud, etc.)
ko: 데이터를 여러 위치(로컬, 클라우드 저장소 등)에 정기적으로 백업하는 것을 권장합니다.
zh: 建议定期备份数据到多个位置（本地、云存储等）

source: Format Info
fr: Info format
ko: 형식 정보
zh: 格式说明

# formatInfoDesc
source: New ZIP format contains complete data and media files; old JSON format contains only text data
fr: Le nouveau format ZIP contient les données complètes et les fichiers multimédias ; l'ancien format JSON ne contient que les données textuelles
ko: 새로운 ZIP 형식은 전체 데이터와 미디어 파일을 포함하며, 이전 JSON 형식은 텍스트 데이터만 포함합니다.
zh: 新版ZIP格式包含完整数据和媒体文件，旧版JSON格式仅包含文本数据

source: Compatibility
fr: Compatibilité
ko: 호환성
zh: 兼容性

# compatibilityDesc
source: Supports importing both new ZIP format and old JSON format backup files
fr: Prend en charge l'importation des fichiers de sauvegarde au nouveau format ZIP et à l'ancien format JSON
ko: 새로운 ZIP 형식과 이전 JSON 형식 백업 파일 가져오기를 모두 지원합니다.
zh: 支持导入新版ZIP格式和旧版JSON格式的备份文件

source: Confirm Restore
fr: Confirmer la restauration
ko: 복원 확인
zh: 确认还原

source: Confirm Merge Import
fr: Confirmer l'importation par fusion
ko: 병합 가져오기 확인
zh: 确认合并导入

source: Start Merge
fr: Démarrer la fusion
ko: 병합 시작
zh: 开始合并

source: Select Import Mode
fr: Sélectionner le mode d'importation
ko: 가져오기 모드 선택
zh: 选择导入模式

# continueAction
source: Continue
fr: Continuer
ko: 계속
zh: 继续

source: Backup Failed
fr: Échec de la sauvegarde
ko: 백업 실패
zh: 备份失败

source: Restore Failed
fr: Échec de la restauration
ko: 복원 실패
zh: 还原失败

# selectFileFailed
source: Failed to select file
fr: Échec de la sélection du fichier
ko: 파일 선택 실패
zh: 选择文件失败

# cannotGetFilePath
source: Cannot get file path, please select again
fr: Impossible d'obtenir le chemin du fichier, veuillez sélectionner à nouveau
ko: 파일 경로를 가져올 수 없습니다. 다시 선택해 주세요.
zh: 无法获取文件路径，请重新选择

source: Invalid Backup File
fr: Fichier de sauvegarde invalide
ko: 유효하지 않은 백업 파일
zh: 无效的备份文件

# invalidBackupFileDesc
source: The selected file is not a valid ThoughtEcho backup file. Please select a correct backup file.
fr: Le fichier sélectionné n'est pas un fichier de sauvegarde ThoughtEcho valide. Veuillez sélectionner un fichier de sauvegarde correct.
ko: 선택한 파일은 유효한 ThoughtEcho 백업 파일이 아닙니다. 올바른 백업 파일을 선택해 주세요.
zh: 所选文件不是有效的心迹备份文件。 请选择正确的备份文件。

source: Backup canceled
fr: Sauvegarde annulée
ko: 백업 취소됨
zh: 备份已取消

source: Restore canceled
fr: Restauration annulée
ko: 복원 취소됨
zh: 还原已取消

source: Unknown field
fr: Champ inconnu
ko: 알 수 없는 필드
zh: 未知字段

source: Confirm Restore Data
fr: Confirmer la restauration des données
ko: 데이터 복원 확인
zh: 确认还原数据

# insightsTitle
source: AI Insights
fr: Aperçus IA
ko: AI 인사이트
zh: AI 洞察

# analysisTypeComprehensive
source: Comprehensive Analysis
fr: Analyse complète
ko: 종합 분석
zh: 全面分析

# analysisTypeComprehensiveDesc
source: Analyze all your notes to explore themes, emotions and thinking patterns
fr: Analyser toutes vos notes pour explorer les thèmes, les émotions et les modèles de pensée
ko: 모든 노트를 분석하여 주제, 감정 및 사고 패턴을 탐색합니다
zh: 综合分析您所有笔记，探索主题、情感和思维模式

# analysisTypeEmotional
source: Emotional Insights
fr: Aperçus émotionnels
ko: 감정 인사이트
zh: 情感洞察

# analysisTypeEmotionalDesc
source: Analyze your emotional state and trends
fr: Analyser votre état émotionnel et vos tendances
ko: 감정 상태와 추세를 분석합니다
zh: 分析您的情绪状态和变化趋势

# analysisTypeMindmap
source: Mind Map
fr: Carte mentale
ko: 마인드맵
zh: 思维导图

# analysisTypeMindmapDesc
source: Build the structure of your thinking and analyze habits
fr: Construire la structure de votre pensée et analyser vos habitudes
ko: 사고 구조를 구축하고 습관을 분석합니다
zh: 构建您思考的结构和思维习惯分析

# analysisTypeGrowth
source: Growth Suggestions
fr: Suggestions de croissance
ko: 성장 제안
zh: 成长建议

# analysisTypeGrowthDesc
source: Personalized growth and progress suggestions based on your notes
fr: Suggestions de croissance et de progrès personnalisées basées sur vos notes
ko: 노트를 기반으로 개인화된 성장 및 진보 제안을 제공합니다
zh: 根据您的笔记提供个性化成长和进步建议

# analysisStyleProfessional
source: Professional Analysis
fr: Analyse professionnelle
ko: 전문적인 분석
zh: 专业分析

# analysisStyleProfessionalDesc
source: Objective and professional analytical perspective
fr: Perspective analytique objective et professionnelle
ko: 객관적이고 전문적인 분석 관점
zh: 客观专业的分析视角

# analysisStyleFriendly
source: Friendly Mentor
fr: Mentor amical
ko: 친근한 멘토
zh: 友好导师

# analysisStyleFriendlyDesc
source: Gentle advice like a friendly mentor
fr: Conseils doux comme un mentor amical
ko: 친근한 멘토와 같은 부드러운 조언
zh: 像一位友好的导师给予温和的建议

# analysisStyleHumorous
source: Humorous Style
fr: Style humoristique
ko: 유머러스한 스타일
zh: 风趣幽默

# analysisStyleHumorousDesc
source: Interpret your thoughts in a humorous way
fr: Interpréter vos pensées de manière humoristique
ko: 유머러스한 방식으로 생각을 해석합니다
zh: 以幽默风趣的方式解读您的思考

# analysisStyleLiterary
source: Literary Style
fr: Style littéraire
ko: 문학적 스타일
zh: 文学风格

# analysisStyleLiteraryDesc
source: Describe your thinking journey in beautiful literary language
fr: Décrire votre voyage de pensée dans un beau langage littéraire
ko: 아름다운 문학적 언어로 사고의 여정을 묘사합니다
zh: 以优美的文学语言描述您的思考旅程

source: Select Analysis Type
fr: Sélectionner le type d'analyse
ko: 분석 유형 선택
zh: 选择分析类型

source: Select Analysis Style
fr: Sélectionner le style d'analyse
ko: 분석 스타일 선택
zh: 选择分析风格

source: Custom Prompt
fr: Invite personnalisée
ko: 사용자 지정 프롬프트
zh: 自定义提示

source: Start Analysis
fr: Démarrer l'analyse
ko: 분석 시작
zh: 开始分析

# stopAnalysis
source: Stop
fr: Arrêter
ko: 중지
zh: 停止

# shareAnalysis
source: Share
fr: Partager
ko: 공유
zh: 分享

# copyAnalysis
source: Copy
fr: Copier
ko: 복사
zh: 复制

# saveAnalysis
source: Save
fr: Enregistrer
ko: 저장
zh: 保存

source: No notes to analyze
fr: Aucune note à analyser
ko: 분석할 노트가 없습니다
zh: 暂无笔记可分析

# noNotesToAnalyzeDesc
source: Add some notes first so AI can provide insights
fr: Ajoutez d'abord quelques notes pour que l'IA puisse fournir des aperçus
ko: AI가 인사이트를 제공할 수 있도록 먼저 노트를 추가해 주세요
zh: 请先添加一些笔记，AI 才能为您提供洞察

source: AI service not configured
fr: Service IA non configuré
ko: AI 서비스가 구성되지 않음
zh: AI服务未配置

source: Configure AI Service
fr: Configurer le service IA
ko: AI 서비스 구성
zh: 配置AI服务

# analysisHistory
source: History
fr: Historique
ko: 기록
zh: 历史记录

source: New Analysis
fr: Nouvelle analyse
ko: 새 분석
zh: 新分析

source: Analyzing...
fr: Analyse en cours...
ko: 분석 중...
zh: 正在分析...

source: Analysis saved
fr: Analyse enregistrée
ko: 분석 저장됨
zh: 分析已保存

# analysisCopied
source: Analysis copied to clipboard
fr: Analyse copiée dans le presse-papiers
ko: 분석이 클립보드에 복사됨
zh: 分析已复制到剪贴板

source: Note saved
fr: Note enregistrée
ko: 노트 저장됨
zh: 笔记已保存

source: Select Card Color
fr: Sélectionner la couleur de la carte
ko: 카드 색상 선택
zh: 选择卡片颜色

source: Preset Colors
fr: Couleurs prédéfinies
ko: 프리셋 색상
zh: 预设颜色

source: Custom Color
fr: Couleur personnalisée
ko: 사용자 지정 색상
zh: 自定义颜色

source: Select
fr: Sélectionner
ko: 선택
zh: 选择

source: Edit Metadata
fr: Modifier les métadonnées
ko: 메타데이터 편집
zh: 编辑元数据

source: Done
fr: Terminé
ko: 완료

source: Select Tags
fr: Sélectionner les étiquettes
ko: 태그 선택

# noMatchingTags
source: No matching tags found
fr: Aucune étiquette correspondante trouvée
ko: 일치하는 태그 없음

source: Smart Analyze Source
fr: Analyse intelligente de la source
ko: 스마트 소스 분석

# smartAnalyzeSourceDesc
source: Analyze potential author and work in the text
fr: Analyser l'auteur potentiel et l'œuvre dans le texte
ko: 텍스트에서 잠재적인 저자와 작품을 분석합니다

source: Polish Text
fr: Peaufiner le texte
ko: 텍스트 윤문

# polishTextDesc
source: Optimize text expression to make it more fluent and elegant
fr: Optimiser l'expression du texte pour le rendre plus fluide et élégant
ko: 텍스트 표현을 더 유려하고 우아하게 최적화합니다

source: Continue Writing
fr: Continuer à écrire
ko: 이어쓰기

# continueWritingDesc
source: Extend current content with the same style and tone
fr: Étendre le contenu actuel avec le même style et le même ton
ko: 동일한 스타일과 어조로 현재 내용을 확장합니다

source: Deep Analysis
fr: Analyse approfondie
ko: 심층 분석

# deepAnalysisDesc
source: Perform in-depth analysis and interpretation of note content
fr: Effectuer une analyse et une interprétation approfondies du contenu de la note
ko: 노트 내용에 대한 심층 분석 및 해석을 수행합니다

source: Ask Note
fr: Demander à la note
ko: 노트에 질문하기

# askNoteDesc
source: Chat with AI assistant to explore note content in depth
fr: Discuter avec l'assistant IA pour explorer le contenu de la note en profondeur
ko: AI 비서와 대화하며 노트 내용을 깊이 있게 탐구합니다

# pleaseEnterContent
source: Please enter content first
fr: Veuillez d'abord saisir du contenu
ko: 먼저 내용을 입력해 주세요

source: Analysis Results
fr: Résultats de l'analyse
ko: 분석 결과

source: Confidence
fr: Confiance
ko: 신뢰도

# noAuthorOrWorkIdentified
source: Could not identify a clear author or work
fr: Impossible d'identifier un auteur ou une œuvre claire
ko: 명확한 저자나 작품을 식별할 수 없습니다

source: Apply Analysis Results
fr: Appliquer les résultats de l'analyse
ko: 분석 결과 적용

# parseResultsFailed
source: Failed to parse results
fr: Échec de l'analyse des résultats
ko: 결과 파싱 실패

# analysisFailed
source: Analysis failed: {error}
fr: Échec de l'analyse : {error}
ko: 분석 실패: {error}

# analysisResultsCopied
source: Analysis results copied to clipboard
fr: Résultats de l'analyse copiés dans le presse-papiers
ko: 분석 결과가 클립보드에 복사됨

source: Note Info
fr: Infos de la note
ko: 노트 정보

source: Source
ko: 출처

source: Created At
fr: Créé le
ko: 작성일

source: Content
fr: Contenu
ko: 내용

source: Periodic Report
fr: Rapport périodique
ko: 정기 보고서
zh: 周期报告

# aiInsightsTab
source: AI Insights
fr: Aperçus IA
ko: AI 인사이트
zh: 智能洞察

source: Location Service Not Enabled
fr: Service de localisation non activé
ko: 위치 서비스가 활성화되지 않음
zh: 位置服务未启用

# pleaseEnableLocationInSettings
source: Please enable location service in system settings
fr: Veuillez activer le service de localisation dans les paramètres système
ko: 시스템 설정에서 위치 서비스를 활성화해 주세요
zh: 请在系统设置中启用位置服务

# locationServiceEnabledMsg
source: Location service enabled
fr: Service de localisation activé
ko: 위치 서비스 활성화됨
zh: 位置服务已启用

source: Quick Tips
fr: Astuces rapides
ko: 빠른 팁
zh: 快速提示

# coreFeature
source: Core
fr: Principal
ko: 핵심
zh: 核心

source: Confirm Delete
fr: Confirmer la suppression
ko: 삭제 확인
zh: 确认删除

# confirmDeleteAnalysis
source: Are you sure you want to delete this analysis record?
fr: Êtes-vous sûr de vouloir supprimer cet enregistrement d'analyse ?
ko: 이 분석 기록을 삭제하시겠습니까?
zh: 确定要删除这条分析记录吗？

# deleteSuccess
source: Deleted successfully
fr: Supprimé avec succès
ko: 성공적으로 삭제됨
zh: 删除成功

# deleteFailed
source: Delete failed: {error}
fr: Échec de la suppression : {error}
ko: 삭제 실패: {error}
zh: 删除失败

source: Service not initialized
fr: Service non initialisé
ko: 서비스가 초기화되지 않음
zh: 服务未初始化

source: Location
fr: Lieu
ko: 위치
zh: 位置

source: Weather
fr: Météo
ko: 날씨
zh: 天气

source: Color
fr: Couleur
ko: 색상
zh: 颜色

source: Note updated
fr: Note mise à jour
ko: 노트 업데이트됨
zh: 笔记已更新

# openFullEditorFailed
source: Failed to open full editor: {error}
fr: Échec de l'ouverture de l'éditeur complet : {error}
ko: 전체 편집기 열기 실패: {error}
zh: 打开全屏编辑器失败: {error}

# saveFailedWithError
source: Save failed: {error}
fr: Échec de l'enregistrement : {error}
ko: 저장 실패: {error}
zh: 保存失败: {error}

source: Theme Settings
fr: Paramètres du thème
ko: 테마 설정
zh: 主题设置

source: Theme Mode
fr: Mode du thème
ko: 테마 모드
zh: 主题模式

# themeModeLight
source: Light
fr: Clair
ko: 라이트
zh: 浅色

# themeModeDark
source: Dark
fr: Sombre
ko: 다크
zh: 深色

source: Use Custom Theme Color
fr: Utiliser une couleur de thème personnalisée
ko: 사용자 지정 테마 색상 사용
zh: 使用自定义主题色

source: Select Theme Color
fr: Sélectionner la couleur du thème
ko: 테마 색상 선택
zh: 选择主题色

source: Dynamic Color
fr: Couleur dynamique
ko: 동적 색상
zh: 动态取色

# dynamicColorDesc
source: Extract theme color from system
fr: Extraire la couleur du thème du système
ko: 시스템에서 테마 색상 추출
zh: 从系统提取主题颜色

# customColorEnabledHint
source: Custom theme color enabled, dynamic color is temporarily disabled
fr: Couleur de thème personnalisée activée, la couleur dynamique est temporairement désactivée
ko: 사용자 지정 테마 색상이 활성화되어 동적 색상이 일시적으로 비활성화됨
zh: 已启用自定义主题色，动态取色功能已暂时禁用

# dynamicColorDisabledHint
source: Dynamic color disabled, using default blue theme
fr: Couleur dynamique désactivée, utilisation du thème bleu par défaut
ko: 동적 색상 비활성화됨, 기본 파란색 테마 사용
zh: 未启用动态取色，将使用默认蓝色主题

source: Theme Tools
fr: Outils de thème
ko: 테마 도구
zh: 主题工具

# themeToolsDesc
source: If theme colors appear abnormal, try refreshing the theme
fr: Si les couleurs du thème semblent anormales, essayez d'actualiser le thème
ko: 테마 색상이 비정상적으로 보이면 테마 새로고침을 시도하세요
zh: 如果主题颜色显示异常，可以尝试刷新主题

source: Theme refreshed
fr: Thème actualisé
ko: 테마 새로고침됨
zh: 主题已刷新

source: Refresh Theme
fr: Actualiser le thème
ko: 테마 새로고침
zh: 刷新主题

# hitokotoSettings
source: Daily Quote Settings
fr: Paramètres de citation du jour
ko: 오늘의 명언 설정
zh: 每日一言设置

# hitokotoTypeSettings
source: Daily Quote Type Settings
fr: Paramètres des types de citation du jour
ko: 명언 유형 설정
zh: 每日一言类型设置

# hitokotoTypeDesc
source: You can select one or more daily quote types. The app will randomly display content from your selected types. Different types represent different content sources and styles.
fr: Vous pouvez sélectionner un ou plusieurs types de citations quotidiennes. L'application affichera aléatoirement du contenu de vos types sélectionnés. Différents types représentent différentes sources et styles de contenu.
ko: 하나 이상의 명언 유형을 선택할 수 있습니다. 앱이 선택한 유형 중에서 무작위로 내용을 표시합니다. 각 유형은 다른 콘텐츠 소스와 스타일을 나타냅니다.
zh: 您可以选择一个或多个"每日一言"类型，程序将从您选择的类型中随机抽取内容展示。不同类型代表不同的内容来源和风格。

source: Select All
fr: Tout sélectionner
ko: 전체 선택
zh: 全选

source: Clear All
fr: Tout effacer
ko: 전체 해제
zh: 清除全部

source: Type Selection
fr: Sélection du type
ko: 유형 선택
zh: 类型选择

# typeSelectionHint
source: Tap to select your preferred quote types
fr: Appuyez pour sélectionner vos types de citations préférés
ko: 탭하여 선호하는 명언 유형을 선택하세요
zh: 点击选择您喜欢的句子类型

# usageInstructions
source: Instructions
ko: 사용 설명
zh: 使用说明

# hitokotoServiceProvider
source: Quote service provided by Hitokoto
fr: Service de citation fourni par Hitokoto
ko: 명언 서비스 제공: Hitokoto
zh: 一言服务由 Hitokoto 提供

# hitokotoHelpItem1
source: At least one type must be selected. The app will randomly display content from selected types
fr: Au moins un type doit être sélectionné. L'application affichera aléatoirement du contenu des types sélectionnés
ko: 적어도 하나의 유형을 선택해야 합니다. 앱이 선택한 유형 중에서 무작위로 내용을 표시합니다
zh: 至少需要选择一种类型，程序会随机展示选中类型的内容

# hitokotoHelpItem2
source: Selecting multiple types provides a richer variety of content
fr: Sélectionner plusieurs types fournit une variété de contenu plus riche
ko: 여러 유형을 선택하면 더 다양한 콘텐츠를 제공받을 수 있습니다
zh: 选择多种类型可以获得更丰富多样的内容体验

# hitokotoHelpItem3
source: Different types represent different content styles and sources
fr: Différents types représentent différents styles et sources de contenu
ko: 각 유형은 다른 콘텐츠 스타일과 출처를 나타냅니다
zh: 不同类型代表不同的内容风格和来源平台

source: Settings saved
fr: Paramètres enregistrés
ko: 설정 저장됨
zh: 设置已保存

source: Tag Management
fr: Gestion des étiquettes
ko: 태그 관리
zh: 标签管理

source: New Tag Name
fr: Nom de la nouvelle étiquette
ko: 새 태그 이름
zh: 新标签名称

# enterTagNameHint
source: Enter tag name (max 50 characters)
fr: Saisir le nom de l'étiquette (max 50 caractères)
ko: 태그 이름 입력 (최대 50자)
zh: 输入标签名称（最多50字）

source: Select Icon
fr: Sélectionner l'icône
ko: 아이콘 선택
zh: 选择图标

source: Adding
fr: Ajout
ko: 추가 중
zh: 添加中

source: Add
fr: Ajouter
ko: 추가
zh: 添加

# pleaseEnterTagName
source: Please enter a tag name
fr: Veuillez saisir un nom d'étiquette
ko: 태그 이름을 입력해 주세요
zh: 请输入标签名称

# tagAddedSuccess
source: Tag added successfully
fr: Étiquette ajoutée avec succès
ko: 태그 추가 성공
zh: 标签添加成功

# addTagFailed
source: Failed to add tag: {error}
fr: Échec de l'ajout de l'étiquette : {error}
ko: 태그 추가 실패: {error}
zh: 添加标签失败：{error}

# iconSelectionHint
source: Choose an icon or enter an emoji as the tag icon
fr: Choisissez une icône ou saisissez un emoji comme icône d'étiquette
ko: 아이콘을 선택하거나 이모지를 입력하여 태그 아이콘으로 사용하세요
zh: 可选一个图标或直接输入一个Emoji作为标签图标

# iconSelected
source: Selected icon: {icon}
fr: Icône sélectionnée : {icon}
ko: 선택된 아이콘: {icon}
zh: 已选择图标：{icon}

source: Clear
fr: Effacer
ko: 지우기
zh: 清除

# loadTagsFailed
source: Failed to load tags: {error}
fr: Échec du chargement des étiquettes : {error}
ko: 태그 로드 실패: {error}
zh: 加载标签失败: {error}

# noTags
source: No tags yet
fr: Pas encore d'étiquette
ko: 아직 태그가 없습니다
zh: 暂无标签

source: Edit Tag
fr: Modifier l'étiquette
ko: 태그 편집
zh: 编辑标签

source: Tag Name
fr: Nom de l'étiquette
ko: 태그 이름
zh: 标签名称

source: Icon
fr: Icône
ko: 아이콘
zh: 图标

# deleteTagConfirmation
source: Are you sure you want to delete the tag "{name}"? Associated notes will be kept but will no longer be linked to this tag.
fr: Êtes-vous sûr de vouloir supprimer l'étiquette "{name}" ? Les notes associées seront conservées mais ne seront plus liées à cette étiquette.
ko: "{name}" 태그를 삭제하시겠습니까? 관련된 노트는 유지되지만 더 이상 이 태그와 연결되지 않습니다.
zh: 确定要删除标签"{name}"吗？相关联的笔记将保留，但不再关联此标签。

# tagDeletedSuccess
source: Tag deleted successfully
fr: Étiquette supprimée avec succès
ko: 태그 삭제 성공
zh: 标签删除成功

# deleteTagFailed
source: Failed to delete tag: {error}
fr: Échec de la suppression de l'étiquette : {error}
ko: 태그 삭제 실패: {error}
zh: 删除标签失败：{error}

# defaultTag
source: Default
fr: Défaut
ko: 기본
zh: 默认

source: System default tag
fr: Étiquette par défaut du système
ko: 시스템 기본 태그
zh: 系统默认标签

source: Tap to edit, long press to delete
fr: Appuyez pour modifier, appui long pour supprimer
ko: 탭하여 편집, 길게 눌러 삭제
zh: 点击编辑，长按删除

# enterEmojiHint
source: Enter an emoji...
fr: Saisir un emoji...
ko: 이모지 입력...
zh: 直接输入表情符号...

# useAsIcon
source: Use "{emoji}" as icon
fr: Utiliser "{emoji}" comme icône
ko: "{emoji}"를 아이콘으로 사용
zh: 使用 "{emoji}" 作为图标

source: System Icons
fr: Icônes système
ko: 시스템 아이콘
zh: 系统图标

source: Storage Management
fr: Gestion du stockage
ko: 저장소 관리
zh: 存储管理

source: Clear Cache
fr: Effacer le cache
ko: 캐시 지우기
zh: 清理缓存

# clearCacheConfirmTitle
source: Clear Cache
fr: Effacer le cache
ko: 캐시 지우기
zh: 清理缓存

# clearCacheConfirmContent
source: Are you sure you want to clear the app cache? This will remove temporary files and image cache, but will not delete your notes.
fr: Êtes-vous sûr de vouloir effacer le cache de l'application ? Cela supprimera les fichiers temporaires et le cache d'images, mais ne supprimera pas vos notes.
ko: 앱 캐시를 지우시겠습니까? 임시 파일과 이미지 캐시가 제거되지만 노트는 삭제되지 않습니다.
zh: 确定要清理应用缓存吗？ 这将清除临时文件、图片缓存等，不会删除您的笔记数据。

# cleanOrphanMedia
source: Clean Unused Media
fr: Nettoyer les médias inutilisés
ko: 미사용 미디어 정리
zh: 清理无用媒体文件

# cleanOrphanMediaConfirmTitle
source: Clean Unused Media Files
fr: Nettoyer les fichiers multimédias inutilisés
ko: 미사용 미디어 파일 정리
zh: 清理无用媒体文件

# cleanOrphanMediaConfirmContent
source: This will delete media files (images, videos, audio) that are not referenced by any notes. Are you sure you want to continue?
fr: Cela supprimera les fichiers multimédias (images, vidéos, audio) qui ne sont référencés par aucune note. Êtes-vous sûr de vouloir continuer ?
ko: 어떤 노트에서도 참조하지 않는 미디어 파일(이미지, 동영상, 오디오)이 삭제됩니다. 계속하시겠습니까?
zh: 这将删除没有被任何笔记引用的媒体文件（图片、视频、音频）。 确定继续吗？

source: Database Maintenance
fr: Maintenance de la base de données
ko: 데이터베이스 유지관리
zh: 数据库维护优化

# databaseMaintenanceConfirmTitle
source: Database Maintenance
fr: Maintenance de la base de données
ko: 데이터베이스 유지관리
zh: 数据库维护优化

# databaseMaintenanceConfirmContent
source: This operation will optimize the database: • Defragment storage space • Update statistics • Rebuild indexes The process may take from a few seconds to several minutes depending on data size. Are you sure you want to continue?
fr: Cette opération optimisera la base de données : • Défragmenter l'espace de stockage • Mettre à jour les statistiques • Reconstruire les index Le processus peut prendre de quelques secondes à plusieurs minutes selon la taille des données. Êtes-vous sûr de vouloir continuer ?
ko: 이 작업은 데이터베이스를 최적화합니다: • 저장 공간 조각 모음 • 통계 업데이트 • 인덱스 재구성 데이터 크기에 따라 몇 초에서 몇 분 정도 소요될 수 있습니다. 계속하시겠습니까?
zh: 此操作将对数据库进行优化维护，包括： • 整理碎片空间 • 更新统计信息 • 重建索引 维护过程可能需要几秒到几分钟，具体取决于数据量大小。 确定继续吗？

source: Start Maintenance
fr: Démarrer la maintenance
ko: 유지관리 시작
zh: 开始维护

# maintenanceInProgress
source: Database maintenance in progress...
fr: Maintenance de la base de données en cours...
ko: 데이터베이스 유지관리 중...
zh: 数据库维护中...

# preparingProgress
source: Preparing...
fr: Préparation...
ko: 준비 중...
zh: 准备中...

source: Maintenance Complete
fr: Maintenance terminée
ko: 유지관리 완료
zh: 维护完成

# maintenanceDuration
source: Duration: {duration} seconds
fr: Durée : {duration} secondes
ko: 소요 시간: {duration}초
zh: 耗时: {duration} 秒

# databaseSizeChange
source: Database size: {before} MB → {after} MB
fr: Taille de la base de données : {before} Mo → {after} Mo
ko: 데이터베이스 크기: {before} MB → {after} MB
zh: 数据库大小: {before} MB → {after} MB

# spaceSavedMb
source: Space saved: {size} MB
fr: Espace économisé : {size} Mo
ko: 확보된 공간: {size} MB
zh: 释放空间: {size} MB

# noSpaceSaved
source: No space saved (database is already compact)
fr: Aucun espace économisé (la base de données est déjà compacte)
ko: 확보된 공간 없음 (데이터베이스가 이미 최적화됨)
zh: 未释放空间（数据库已很紧凑）

# maintenanceFailed
source: Maintenance failed: {error}
fr: Échec de la maintenance : {error}
ko: 유지관리 실패: {error}
zh: 维护失败: {error}

# loadStorageInfoFailed
source: Failed to load storage info: {error}
fr: Échec du chargement des infos de stockage : {error}
ko: 저장소 정보 로드 실패: {error}
zh: 加载存储信息失败: {error}

# cacheCleanedResult
source: Cache cleared, freed {size}
fr: Cache effacé, {size} libérés
ko: 캐시 삭제됨, {size} 확보
zh: 缓存清理完成，释放了 {size}

# clearCacheFailed
source: Failed to clear cache: {error}
fr: Échec de l'effacement du cache : {error}
ko: 캐시 삭제 실패: {error}
zh: 清理缓存失败: {error}

# orphanFilesCleanedResult
source: {count, plural, =0{No unused files found} =1{Cleanup complete, deleted 1 unused file} other{Cleanup complete, deleted {count} unused files}}
fr: {count, plural, =0{Aucun fichier inutilisé trouvé} =1{Nettoyage terminé, 1 fichier inutilisé supprimé} other{Nettoyage terminé, {count} fichiers inutilisés supprimés}}
ko: {count, plural, =0{미사용 파일 없음} =1{정리 완료, 미사용 파일 1개 삭제됨} other{정리 완료, 미사용 파일 {count}개 삭제됨}}
zh: 清理完成，删除了 {count} 个无用文件

# noOrphanFilesFound
source: No unused files found
fr: Aucun fichier inutilisé trouvé
ko: 미사용 파일 없음
zh: 没有发现无用文件

# cleanupFailed
source: Cleanup failed: {error}
fr: Échec du nettoyage : {error}
ko: 정리 실패: {error}
zh: 清理失败: {error}

source: Total Storage Usage
fr: Utilisation totale du stockage
ko: 총 저장소 사용량
zh: 总占用空间

source: Database Usage
fr: Utilisation de la base de données
ko: 데이터베이스 사용량
zh: 数据库占用

source: Media Files Usage
fr: Utilisation des fichiers multimédias
ko: 미디어 파일 사용량
zh: 媒体文件占用

source: Cache Usage
fr: Utilisation du cache
ko: 캐시 사용량
zh: 缓存占用

source: Notes Database
fr: Base de données des notes
ko: 노트 데이터베이스
zh: 笔记数据库

source: AI Database
fr: Base de données IA
ko: AI 데이터베이스
zh: AI数据库

source: Log Database
fr: Base de données des journaux
ko: 로그 데이터베이스
zh: 日志数据库

source: Images
ko: 이미지
zh: 图片

source: Videos
fr: Vidéos
ko: 동영상
zh: 视频

# audios
source: Audio
ko: 오디오
zh: 音频

# tempFilesAndCache
source: Temporary files and cache
fr: Fichiers temporaires et cache
ko: 임시 파일 및 캐시
zh: 临时文件和缓存

# fileCount
source: {count, plural, =1{1 file} other{{count} files}}
fr: {count, plural, =1{1 fichier} other{{count} fichiers}}
ko: {count, plural, =1{1개 파일} other{{count}개 파일}}
zh: {count} 个文件

source: Data Storage Location
fr: Emplacement de stockage des données
ko: 데이터 저장 위치
zh: 数据存储位置
