Repository: Shangjin-Xiao/ThoughtEcho
Catalog: lib/l10n/app_*.arb
Languages: fr, ko, zh

# noPresetsSaved
source: No saved presets yet. Configure the API information and click "Save Settings" to create the first preset.
fr: Aucun préréglage enregistré pour l'instant. Configurez les informations de l'API et cliquez sur "Enregistrer les paramètres" pour créer le premier préréglage.
ko: 아직 저장된 프리셋이 없습니다. API 정보를 구성하고 "설정 저장"을 클릭하여 첫 번째 프리셋을 생성하세요.

source: Rename
fr: Renommer
ko: 이름 변경

# testConnectionButton
source: Test Connection
fr: Tester la connexion
ko: 연결 테스트

# reportInsightsUseAi
source: Use AI for Periodic Report Insights
fr: Utiliser l'IA pour les aperçus du rapport périodique
ko: 정기 보고서 인사이트에 AI 사용

# reportInsightsUseAiDesc
source: When enabled, an "Insightful Poem" will be automatically generated when entering the report page. If disabled, local generation will be used.
fr: Si activé, un "Poème perspicace" sera généré automatiquement en entrant dans la page du rapport. Si désactivé, la génération locale sera utilisée.
ko: 활성화하면 보고서 페이지 진입 시 "통찰의 시"가 자동으로 생성됩니다. 비활성화하면 로컬 생성을 사용합니다.

# aiSettingsTitle
source: AI Settings
fr: Paramètres IA
ko: AI 설정

source: Quick Presets
fr: Préréglages rapides
ko: 빠른 프리셋

# selectPreset
source: Select a provider preset
fr: Sélectionner un préréglage de fournisseur
ko: 공급자 프리셋 선택

# selectPresetHint
source: Or manually configure the connection parameters below
fr: Ou configurer manuellement les paramètres de connexion ci-dessous
ko: 또는 아래에서 연결 매개변수를 수동으로 구성하세요

# connectionConfig
source: Connection Configuration ({providerName})
fr: Configuration de la connexion ({providerName})
ko: 연결 구성 ({providerName})

# apiUrlHint
source: e.g., https://api.xxx.com/v1/chat/completions
fr: par ex., https://api.xxx.com/v1/chat/completions
ko: 예: https://api.xxx.com/v1/chat/completions

# apiUrlHelper
source: Must be an http/https URL
fr: Doit être une URL http/https
ko: http/https URL이어야 합니다

# apiKeyHint
source: The key required for the service (can be left blank)
fr: La clé requise pour le service (peut être laissée vide)
ko: 서비스에 필요한 키 (공란일 수 있음)

source: Show
fr: Afficher
ko: 표시

source: Hide
fr: Masquer
ko: 숨기기

# modelAndAdvanced
source: Model & Advanced
fr: Modèle et avancé
ko: 모델 및 고급

# modelNameField
source: Model Name
fr: Nom du modèle
ko: 모델 이름

# modelNameHint
source: Please enter a model name
fr: Veuillez saisir un nom de modèle
ko: 모델 이름을 입력하세요

# modelNameHintDefault
source: Use default model or customize
fr: Utiliser le modèle par défaut ou personnaliser
ko: 기본 모델 사용 또는 사용자 지정

# hostOverrideField
source: Host Override
fr: Remplacement de l'hôte
ko: 호스트 재정의

# hostOverrideHint
source: Optional, for proxy/reverse proxy scenarios
fr: Optionnel, pour les scénarios de proxy/proxy inverse
ko: 선택 사항, 프록시/리버스 프록시 시나리오용

source: Create New Preset
fr: Créer un nouveau préréglage
ko: 새 프리셋 생성

source: AI Card Generation
fr: Génération de carte IA
ko: AI 카드 생성

# aiCardGenerationDesc
source: Generate SVG sharing cards for notes: On = use AI for smart design, Off = use built-in templates (feature still available)
fr: Générer des cartes de partage SVG pour les notes : On = utiliser l'IA pour la conception intelligente, Off = utiliser des modèles intégrés (fonctionnalité toujours disponible)
ko: 노트용 SVG 공유 카드 생성: 켜기 = AI 스마트 디자인 사용, 끄기 = 내장 템플릿 사용 (기능은 여전히 사용 가능)

# aiCardGenerationTip
source: Tip: It is recommended to use a medium-to-large model that supports ≥4K tokens and has good instruction following and text-to-SVG generation capabilities.
fr: Conseil : Il est recommandé d'utiliser un modèle moyen à grand qui prend en charge ≥4K jetons et possède de bonnes capacités de suivi d'instructions et de génération texte-vers-SVG.
ko: 팁: 4K 토큰 이상을 지원하고 지침 준수 및 텍스트-SVG 생성 기능이 우수한 중대형 모델을 사용하는 것이 좋습니다.

source: AI Enhanced Generation
fr: Génération améliorée par IA
ko: AI 향상된 생성

# aiEnhancedGenerationDesc
source: When turned off, local templates will be used instead of calling the model
fr: Lorsqu'il est désactivé, les modèles locaux seront utilisés au lieu d'appeler le modèle
ko: 끄면 모델을 호출하는 대신 로컬 템플릿이 사용됩니다

# todayThoughtsUseAi
source: Use AI for Today's Thoughts
fr: Utiliser l'IA pour les Pensées du jour
ko: 오늘의 생각에 AI 사용

# todayThoughtsUseAiDesc
source: When enabled, AI will be used to generate prompts for Today's Thoughts. If disabled, local generation will be used.
fr: Si activé, l'IA sera utilisée pour générer des invites pour les Pensées du jour. Si désactivé, la génération locale sera utilisée.
ko: 활성화하면 AI를 사용하여 오늘의 생각 프롬프트를 생성합니다. 비활성화하면 로컬 생성을 사용합니다.

# apiUrlRequired
source: API URL cannot be empty
fr: L'URL de l'API ne peut pas être vide
ko: API URL은 비워둘 수 없습니다

# invalidUrl
source: Please enter a valid HTTP/HTTPS URL
fr: Veuillez saisir une URL HTTP/HTTPS valide
ko: 유효한 HTTP/HTTPS URL을 입력해 주세요

# mediaManagementTitle
source: Media File Management
fr: Gestion des fichiers multimédias
ko: 미디어 파일 관리

# loadStatsError
source: Failed to load statistics: {error}
fr: Échec du chargement des statistiques : {error}
ko: 통계 로드 실패: {error}

source: {operation} completed
fr: {operation} terminée
ko: {operation} 완료

# operationFailed
source: {operation} failed: {error}
fr: {operation} a échoué : {error}
ko: {operation} 실패: {error}

# loadStatsFailed
source: Failed to load statistics
fr: Échec du chargement des statistiques
ko: 통계 로드 실패

# mediaFileStats
source: Media File Statistics
fr: Statistiques des fichiers multimédias
ko: 미디어 파일 통계

source: Total Files
fr: Total des fichiers
ko: 총 파일

source: Referenced Files
fr: Fichiers référencés
ko: 참조된 파일

source: Orphan Files
fr: Fichiers orphelins
ko: 미사용 파일

source: Total References
fr: Total des références
ko: 총 참조

source: Total Size
fr: Taille totale
ko: 총 크기

source: Images Size
fr: Taille des images
ko: 이미지 크기

source: Videos Size
fr: Taille des vidéos
ko: 동영상 크기

source: Audios Size
fr: Taille des audios
ko: 오디오 크기

# tempFiles
source: Temporary Files
fr: Fichiers temporaires
ko: 임시 파일

# tempFilesCount
source: Temporary Files Count
fr: Nombre de fichiers temporaires
ko: 임시 파일 수

source: Expired Files Count
fr: Nombre de fichiers expirés
ko: 만료된 파일 수

# tempFilesSize
source: Temporary Files Size
fr: Taille des fichiers temporaires
ko: 임시 파일 크기

source: Cleanup Operations
fr: Opérations de nettoyage
ko: 정리 작업

# cleanupExpiredTempFiles
source: Clean up expired temporary files
fr: Nettoyer les fichiers temporaires expirés
ko: 만료된 임시 파일 정리

# cleanupExpiredTempFilesDesc
source: Delete temporary files older than 24 hours
fr: Supprimer les fichiers temporaires datant de plus de 24 heures
ko: 24시간 이상 된 임시 파일 삭제

source: Clean up orphan files
fr: Nettoyer les fichiers orphelins
ko: 미사용 파일 정리

# cleanupOrphanFilesDesc
source: Delete media files not referenced by any notes
fr: Supprimer les fichiers multimédias non référencés par aucune note
ko: 어떤 노트에서도 참조하지 않는 미디어 파일 삭제

source: Full Cleanup
fr: Nettoyage complet
ko: 전체 정리

# fullCleanupDesc
source: Clean up all temporary and orphan files
fr: Nettoyer tous les fichiers temporaires et orphelins
ko: 모든 임시 파일 및 미사용 파일 정리

source: Migrate Existing Notes
fr: Migrer les notes existantes
ko: 기존 노트 마이그레이션

# migrateExistingNotesDesc
source: Re-establish media file references for existing notes
fr: Rétablir les références de fichiers multimédias pour les notes existantes
ko: 기존 노트의 미디어 파일 참조 재설정

source: Verify File Integrity
fr: Vérifier l'intégrité des fichiers
ko: 파일 무결성 검사

# verifyFileIntegrityDesc
source: Check the integrity of media file references
fr: Vérifier l'intégrité des références de fichiers multimédias
ko: 미디어 파일 참조의 무결성 확인

source: {operation} Result
fr: Résultat de {operation}
ko: {operation} 결과

source: Cleaned Files Count
fr: Nombre de fichiers nettoyés
ko: 정리된 파일 수

# spaceSavedMbLabel
source: Space Saved (MB)
fr: Espace économisé (Mo)
ko: 확보된 공간 (MB)

source: Migrated Quotes Count
fr: Nombre de citations migrées
ko: 마이그레이션된 인용 수

source: Orphan Files Detected
fr: Fichiers orphelins détectés
ko: 미사용 파일 감지됨

source: Checked References Count
fr: Nombre de références vérifiées
ko: 확인된 참조 수

source: Missing Files Count
fr: Nombre de fichiers manquants
ko: 누락된 파일 수

source: File Integrity
fr: Intégrité des fichiers
ko: 파일 무결성

source: Normal
ko: 정상

source: Abnormal
fr: Anormal
ko: 비정상

source: Your Thought Track
fr: Votre piste de pensée
ko: 당신의 생각 트랙

# tapToExplore
source: Tap the screen to start exploring
fr: Appuyez sur l'écran pour commencer à explorer
ko: 화면을 탭하여 탐색 시작

source: Annual Overview
fr: Aperçu annuel
ko: 연간 개요

# noNotesInPeriod
source: No notes in this period
fr: Aucune note dans cette période
ko: 이 기간에 노트 없음

# startRecording
source: Start recording your thoughts
fr: Commencez à enregistrer vos pensées
ko: 생각 기록 시작

source: Total Recorded
fr: Total enregistré
ko: 총 기록

# notesUnit
source: notes
ko: 개 노트

source: Writing Days
fr: Jours d'écriture
ko: 작성 일수

# daysUnit
source: days
fr: jours
ko: 일

source: Longest Streak
fr: Plus longue série
ko: 최장 연속

source: Tags Used
fr: Étiquettes utilisées
ko: 사용된 태그

# tagsUnit
source: tags
fr: étiquettes
ko: 개 태그

source: Writing Habits
fr: Habitudes d'écriture
ko: 작성 습관

# noWritingHabits
source: No writing habits data yet
fr: Aucune donnée sur les habitudes d'écriture pour l'instant
ko: 아직 작성 습관 데이터 없음

source: Most Active Time
fr: Heure la plus active
ko: 가장 활발한 시간

source: No data
fr: Pas de données
ko: 데이터 없음

source: Favorite Day
fr: Jour préféré
ko: 선호 요일

source: Avg. Words Per Note
fr: Mots moy. par note
ko: 노트당 평균 단어 수

# wordsUnit
source: words
fr: mots
ko: 단어

source: Longest Note
fr: Note la plus longue
ko: 가장 긴 노트

source: Most Common Period
fr: Période la plus courante
ko: 가장 흔한 시간대

source: Most Common Weather
fr: Météo la plus courante
ko: 가장 흔한 날씨

source: Most Used Tag
fr: Étiquette la plus utilisée
ko: 가장 많이 사용된 태그

source: Tag Analysis
fr: Analyse des étiquettes
ko: 태그 분석

source: Most Used Tags
fr: Étiquettes les plus utilisées
ko: 가장 많이 사용된 태그

# usedXTimes
source: Used {count} times ({percentage}%)
fr: Utilisé {count} fois ({percentage}%)
ko: {count}회 사용됨 ({percentage}%)

# noTagsUsed
source: No tags have been used yet
fr: Aucune étiquette n'a encore été utilisée
ko: 아직 사용된 태그가 없습니다

source: Timeline
fr: Chronologie
ko: 타임라인

# noRecordsInPeriod
source: No records in this period
fr: Aucun enregistrement dans cette période
ko: 이 기간에 기록 없음

# monthX
source: Month {month}
fr: Mois {month}
ko: {month}월

# notesCount
source: {count} notes
ko: {count}개 노트

source: Deep Insights
fr: Aperçus approfondis
ko: 심층 인사이트

source: Thinking Density
fr: Densité de pensée
ko: 사고 밀도

# deepThinker
source: You enjoy deep thinking, and each note is very detailed. This habit helps you organize your thoughts better.
fr: Vous aimez penser profondément, et chaque note est très détaillée. Cette habitude vous aide à mieux organiser vos pensées.
ko: 당신은 깊이 있는 생각을 즐기며, 각 노트가 매우 상세합니다. 이 습관은 생각을 더 잘 정리하는 데 도움이 됩니다.

# conciseThinker
source: Your thinking is concise and powerful, and you are good at grasping the main points. This is a great summarizing skill.
fr: Votre pensée est concise et puissante, et vous êtes doué pour saisir les points principaux. C'est une excellente compétence de synthèse.
ko: 당신의 생각은 간결하고 강력하며, 요점을 잘 파악합니다. 이것은 훌륭한 요약 능력입니다.

# quickThinker
source: You are used to recording short ideas, which allows you to quickly capture inspiration. This is a great recording habit.
fr: Vous avez l'habitude d'enregistrer de courtes idées, ce qui vous permet de capturer rapidement l'inspiration. C'est une excellente habitude d'enregistrement.
ko: 당신은 짧은 아이디어를 기록하는 데 익숙하여 영감을 빠르게 포착할 수 있습니다. 이것은 훌륭한 기록 습관입니다.

source: Growth Track
fr: Piste de croissance
ko: 성장 트랙

# notStarted
source: You haven't started recording yet, now is the best time.
fr: Vous n'avez pas encore commencé à enregistrer, c'est le meilleur moment maintenant.
ko: 아직 기록을 시작하지 않았습니다. 지금이 가장 좋은 시기입니다.

# increasingFrequency
source: Your recording frequency is getting higher and higher! From the beginning to the end of the year, the habit of thinking and recording has gotten better and better.
fr: Votre fréquence d'enregistrement est de plus en plus élevée ! Du début à la fin de l'année, l'habitude de penser et d'enregistrer s'est améliorée de plus en plus.
ko: 기록 빈도가 점점 높아지고 있습니다! 연초부터 연말까지 생각하고 기록하는 습관이 점점 더 좋아졌습니다.

# decreasingFrequency
source: The records at the beginning of the year were very active, maybe you can regain the enthusiasm for writing at that time.
fr: Les enregistrements au début de l'année étaient très actifs, peut-être pouvez-vous retrouver l'enthousiasme pour l'écriture à ce moment-là.
ko: 연초 기록은 매우 활발했습니다. 그때의 글쓰기 열정을 다시 되찾을 수 있을지도 모릅니다.

# stableRhythm
source: You have maintained a stable recording rhythm, and this persistence is rare!
fr: Vous avez maintenu un rythme d'enregistrement stable, et cette persistance est rare !
ko: 안정적인 기록 리듬을 유지하고 있습니다. 이러한 끈기는 드문 일입니다!

# beginningOfYear
source: This year is the beginning of recording, looking forward to seeing more thought tracks.
fr: Cette année est le début de l'enregistrement, j'ai hâte de voir plus de pistes de pensée.
ko: 올해는 기록의 시작입니다. 더 많은 생각 트랙을 볼 수 있기를 기대합니다.

source: Writing Rhythm
fr: Rythme d'écriture
ko: 작성 리듬

# goodRhythm
source: You have a good writing rhythm, with the longest continuous recording of {longestStreak} days! Persistence is power.
fr: Vous avez un bon rythme d'écriture, avec la plus longue série continue de {longestStreak} jours ! La persistance est le pouvoir.
ko: 좋은 작성 리듬을 가지고 있으며, 최장 연속 기록은 {longestStreak}일입니다! 끈기는 힘입니다.

# decentRhythm
source: You have established a good recording habit, keep up this rhythm.
fr: Vous avez établi une bonne habitude d'enregistrement, gardez ce rythme.
ko: 좋은 기록 습관을 확립했습니다. 이 리듬을 계속 유지하세요.

# startRhythm
source: Recording more is a habit, you can try to record some small ideas every day.
fr: Enregistrer plus est une habitude, vous pouvez essayer d'enregistrer quelques petites idées chaque jour.
ko: 더 많이 기록하는 것이 습관입니다. 매일 작은 아이디어를 기록해 보세요.

# generatingInsights
source: Generating insights for this period...
fr: Génération d'aperçus pour cette période...
ko: 이 기간에 대한 인사이트 생성 중...

# noInsights
source: No insights yet
fr: Aucun aperçu pour l'instant
ko: 아직 인사이트 없음

# thankYou
source: Thank you for your persistence
fr: Merci pour votre persistance
ko: 당신의 끈기에 감사합니다

# everyThoughtCounts
source: Every thought is worth recording Every record is a footprint of growth
fr: Chaque pensée vaut la peine d'être enregistrée Chaque enregistrement est une empreinte de croissance
ko: 모든 생각은 기록할 가치가 있습니다 모든 기록은 성장의 발자취입니다

# continueRecording
source: Continue recording in {year}
fr: Continuer à enregistrer en {year}
ko: {year}년에도 계속 기록하기

# reportCopied
source: Annual report has been copied to the clipboard
fr: Le rapport annuel a été copié dans le presse-papiers
ko: 연간 보고서가 클립보드에 복사되었습니다

source: Monday
fr: Lundi
ko: 월요일

source: Tuesday
fr: Mardi
ko: 화요일

source: Wednesday
fr: Mercredi
ko: 수요일

source: Thursday
fr: Jeudi
ko: 목요일

source: Friday
fr: Vendredi
ko: 금요일

source: Saturday
fr: Samedi
ko: 토요일

source: Sunday
fr: Dimanche
ko: 일요일

# dayOfMonth
source: Day {day}
fr: Jour {day}
ko: {day}일

# noteLocation
source: at {location}
fr: à {location}
ko: {location}에서

# noteWeather
source: (Weather: {weather})
fr: (Météo : {weather})
ko: (날씨: {weather})

# annualReportForYear
source: {year} Annual Report
fr: Rapport annuel {year}
ko: {year} 연간 보고서

# annualReportTitle
source: ThoughtEcho Annual Report
fr: Rapport annuel ThoughtEcho
ko: ThoughtEcho 연간 보고서

# shareAnnualReportContent
source: My {year} ThoughtEcho Review 📝 Recorded {totalQuotes} thoughts 💭 Witnessed a year of growth and reflection Recording the bits and pieces of life in ThoughtEcho #ThoughtEcho #AnnualReview #Journal
fr: Ma revue ThoughtEcho {year} 📝 Enregistré {totalQuotes} pensées 💭 Témoin d'une année de croissance et de réflexion Enregistrer les morceaux de vie dans ThoughtEcho #ThoughtEcho #RevueAnnuelle #Journal
ko: 나의 {year} ThoughtEcho 회고 📝 {totalQuotes}개의 생각 기록 💭 1년의 성장과 성찰을 목격함 삶의 조각들을 ThoughtEcho에 기록하며 #ThoughtEcho #연간회고 #일기

# aiFeatures
source: AI
fr: IA

source: ThoughtEcho AI
fr: ThoughtEcho IA

# apiKeyLabel
source: API Key: {status}
fr: Clé API : {status}

# apiUrlField
source: API URL
fr: URL de l'API

# apiKeyField
source: API Key
fr: Clé API

# noteDate
source: {month} {day}
fr: {day} {month}

# appTitle
source: ThoughtEcho
zh: 心迹
